Repository: FreshRSS/FreshRSS
Catalog: docs/i18n/freshrss.*.po
Languages: fr

source: Join us on the mailing lists
fr: Rejoignez-nous sur les listes de mailing

source: Do you want to ask us some questions? Do you want to discuss with us? Don't hesitate to subscribe to our mailing lists!
fr: S'il vous manque des informations, n'hésitez pas à fouiller un peu la documentation ou venir nous poser directement vos questions sur [la mailing list des développeurs](https://freshrss.org/mailman/listinfo/dev).

source: The first mailing is destined to generic information, it should be adapted to users. [Join mailing@freshrss.org](https://freshrss.org/mailman/listinfo/mailing).
fr: Le premier mailing est destiné à l'information générique, il doit être adapté aux utilisateurs. [Rejoignez mailing@freshrss.org](https://freshrss.org/mailman/listinfo/mailing).

source: The second mailing is mainly for developers. [Join dev@freshrss.org](https://freshrss.org/mailman/listinfo/dev)
fr: Le deuxième mailing s'adresse principalement aux développeurs. [Rejoignez dev@freshrss.org](https://freshrss.org/mailman/listinfo/dev)

source: Report a bug
fr: Signaler un bug

source: Have you found a bug? Don't panic, here are some steps to report it with ease:
fr: Avez-vous trouvé un bogue ? Ne paniquez pas, voici quelques étapes pour le signaler facilement :

source: Search for it on [the bug tracker](https://github.com/FreshRSS/FreshRSS/issues) (don't forget to use the search bar).
fr: Cherche sur [le bug tracker](https://github.com/FreshRSS/FreshRSS/issues) (n'oubliez pas d'utiliser la barre de recherche).

source: If you find a similar bug, don't hesitate to post a comment to add more importance to the related ticket.
fr: Si vous constatez un bogue similaire, n'hésitez pas à poster un commentaire pour ajouter de l'importance au ticket correspondant.

source: If you didn't find it, [open a new ticket](https://github.com/FreshRSS/FreshRSS/issues/new).
fr: Si vous ne l'avez pas trouvé, [ouvrez un nouveau ticket](https://github.com/FreshRSS/FreshRSS/issues/new).

source: If you have to create a new ticket, please try to keep in mind the following advice:
fr: Si vous devez créer un nouveau ticket, essayez de garder les conseils suivants :

source: Give an explicit title to the ticket so it will be easier to find it later.
fr: Donnez un titre explicite au ticket pour le retrouver plus facilement plus tard.

source: Be as exhaustive as possible in the description: what did you do? What is the bug? What are the steps to reproduce the bug?
fr: Soyez aussi exhaustif que possible dans la description : qu'avez-vous fait ? Quel est le bogue ? Quelles sont les étapes pour reproduire le bogue ?

source: We also need some information:
fr: Nous avons aussi besoin de quelques informations :

source: Your FreshRSS version (on the about page or in the `constants.php` file)
fr: Votre version de FreshRSS (sur la page A propos) ou le fichier `constants.php`)

source: Your server configuration: the type of hosting and the PHP version
fr: Votre configuration de serveur : type d'hébergement, version PHP

source: Your storage system (SQLite, MySQL, MariaDB, PostgreSQL)
fr: Quelle base de données : SQLite, MySQL, MariaDB, PostgreSQL ? Quelle version ?

source: If possible, the related logs (PHP logs and FreshRSS logs under `data/users/your_user/log.txt`)
fr: Si possible, les logs associés (logs PHP et logs FreshRSS sous `data/users/your_user/log.txt`)

source: Fix a bug
fr: Corriger un bogue

source: Would you like to fix a bug? For optimum coordination between collaborators, you should follow these indications:
fr: Voulez-vous corriger un bogue ? Pour maintenir une grande coordination entre les collaborateurs, vous devrez suivre ces indications :

source: Be sure the bug is associated with a ticket and indicate that you'll work on it.
fr: Assurez-vous que le bogue est associé à un ticket et indiquez que vous allez travailler sur le bogue.

source: [Fork the project repository](https://help.github.com/articles/fork-a-repo/).
fr: [Fork du répertoire de projet](https://help.github.com/articles/fork-a-repo/).

source: [Create a new branch](https://help.github.com/articles/creating-and-deleting-branches-within-your-repository/). The name of the branch should be clear, and ideally prefixed by the related ticket id. For instance, `783-contributing-file` to fix [ticket #783](https://github.com/FreshRSS/FreshRSS/issues/783).
fr: [Créez une nouvelle branche](https://help.github.com/articles/creating-and-deleting-branches-within-your-repository/). Le nom de la branche doit être clair, et idéalement préfixé par l'identifiant du ticket correspondant. Par exemple, `783-contributing-file` pour réparer [ticket #783](https://github.com/FreshRSS/FreshRSS/issues/783).

source: Make your changes to your fork and [send a pull request](https://help.github.com/articles/using-pull-requests/).
fr: Ajoutez vos modifications à votre fork et [ouvrez une demande de pull request](https://help.github.com/articles/using-pull-requests/).

source: If you have to write code, please follow [our coding style recommendations](developers/01_First_steps.md).
fr: Si vous devez écrire du code, veuillez suivre [nos recommandations de style de codage](developers/01_First_steps.md).

source: **Tip:** if you're searching for easy-to-fix bugs, please have a look at the "[good first issue](https://github.com/FreshRSS/FreshRSS/issues?q=is%3Aopen+is%3Aissue+label%3A%22good+first+issue%22)" ticket label.
fr: **Conseil : **si vous cherchez des bugs faciles à corriger, jetez un coup d'oeil à la vignette "[good first issue](https://github.com/FreshRSS/FreshRSS/issues?q=is%3Aopen+is%3Aissue+label%3A%22good+first+issue%22)".

source: Submit an idea
fr: Soumettre une idée

source: You have great ideas, yes! Don't be shy and open [a new ticket](https://github.com/FreshRSS/FreshRSS/issues/new) on our bug tracker to ask if we can implement it. The greatest ideas often come from the shyest suggestions!
fr: Vous avez de bonnes idées, oui ! Ne soyez pas timide et ouvrez [un nouveau ticket](https://github.com/FreshRSS/FreshRSS/issues/new) sur notre tracker bogue pour nous demander si nous pouvons le mettre en œuvre. Les plus grandes idées viennent souvent des suggestions les plus timides !

source: If your idea is nice, we'll have a look at it.
fr: Si votre idée est bonne, nous y jetterons un coup d'oeil.

source: Contribute to internationalization (i18n)
fr: Contribuer à l'internationalisation (i18n)

source: If you want to improve internationalization, please open a new ticket first and follow the advice from the *Fix a bug* section.
fr: Si vous voulez améliorer l'internationalisation, ouvrez d'abord un nouveau ticket et suivez les conseils de la section *Fixer un bogue*.

source: Translations are present in the subdirectories of `./app/i18n/`.
fr: Les traductions sont disponibles dans les sous-répertoires de `./app/i18n/`.

source: We're working on a better way to handle internationalization, but don't hesitate to suggest any ideas!
fr: Nous travaillons sur une meilleure façon de gérer l'internationalisation mais n'hésitez pas à nous suggérer des idées !

source: Contribute to documentation
fr: Contribuer à la documentation

source: The documentation needs a lot of improvements in order to be more useful to new contributors and we are working on it. If you want to give some help, meet us in the main repositories [docs directory](https://github.com/FreshRSS/FreshRSS/tree/master/docs)!
fr: Il ne vous aura pas échappé que la documentation est encore un peu vide… il y a énormément de choses à faire ! Si vous souhaitez aider à écrire quelques pages, rendez-vous dans les principaux dépôts[fichier docs](https://github.com/FreshRSS/FreshRSS/tree/master/docs) !

source: Environment configuration (Docker)
fr: Configurer son environnement (Docker)

source: FreshRSS is built with PHP and uses a homemade framework, Minz. The dependencies are directly included in the source code, so you don't need Composer.
fr: FreshRSS est construit en PHP et utilise le framework Minz. Les dépendancessont directement incluses dans le code source, donc vous n'avez pas besoin d'utiliser Composer.

source: There are various ways to configure your development environment. The easiest and most supported method is based on Docker, which is the solution documented below. If you already have a working PHP environment, you probably don't need it.
fr: Il existe plusieurs façons de configurer votre environnement dedéveloppement. La méthode la plus simple et la plus supportée est basée surDocker. C'est la solution qui est documentée ci-dessous. Si vous avez déjà unenvironnement PHP fonctionnel, vous n'en avez probablement pas besoin.

source: We assume here that you use a GNU/Linux distribution, capable of running Docker. Otherwise, you'll have to adapt the commands accordingly.
fr: Nous supposons ici que vous utilisez une distribution GNU/Linux, capable d'exécuter Docker. Sinon, vous devrez adapter les commandes en conséquence.

source: The commands that follow have to be executed in a console. They start by `$` when commands need to be executed as normal user, and by `#` when they need to be executed as root user. You don't have to type these characters. A path may be indicated before these characters to help you identify where they need to be executed. For instance, `app$ echo 'Hello World'` indicates that you have to execute `echo` command in the `app/` directory.
fr: Les commandes qui suivent doivent être exécutées dans une console. Ils commencent par `$` quand les commandes doivent être exécutées en tant qu'utilisateur normal, et par `#` quand elles doivent être exécutées en tant qu'utilisateur root. Vous n'avez pas besoin de taper ces caractères. Un chemin d'accès peut être indiqué devant ces caractères pour vous aider à identifier où ils doivent être exécutés. Par exemple, `app$ echo 'Hello World'` indique que vous devez exécuter la commande `echo` dans le répertoire `app/`.

source: First, you need to install [Docker](https://docs.docker.com/install/linux/docker-ce/ubuntu/).
fr: Tout d'abord, vous devez installer [Docker](https://docs.docker.com/install/linux/docker-ce/ubuntu/).

source: Once you're done, clone the repository with:
fr: Une fois que c'est fait, clonez le dépôt de code de la manière suivante :

source: Note that, if you want to contribute, you have to fork the repository first and clone your fork instead of the "root" one. Adapt the commands in consequence.
fr: Notez que, pour contribuer, vous devrez d'abord « forker » ce dépôt de code (ou dépôt de code référent) et cloner votre « fork » à la place de ce dépôt. Adaptez les commandes en conséquence.

source: Then, the only command you need to know is the following:
fr: Ensuite, la seule commande que vous devez connaître est la suivante :

source: This might take some time while Docker downloads the image. If your user isn't in the `docker` group, you'll need to prepend the command with `sudo`.
fr: Cela peut prendre un certain temps pour que Docker télécharge l'image utilisée. Dans le cas où la commande échoue pour un problème de droit, il faudra soit ajouter votre utilisateur au groupe `docker`, soit relancer la commande en la préfixant par `sudo`.

source: **You can now access FreshRSS at [http://localhost:8080](http://localhost:8080).** Just follow the install process and select the SQLite database.
fr: **Vous pouvez maintenant accéder à FreshRSS à [http://localhost:8080](http://localhost:8080).** Suivez simplement le processus d'installation et sélectionnez la base de données SQLite.

source: You can stop the containers by typing <kbd>Control</kbd> + <kbd>c</kbd> or with the following command, in another terminal:
fr: Vous pouvez arrêter les conteneurs en tapant <kbd>Control</kbd> + <kbd>c</kbd> ou avec la commande suivante, dans un autre terminal:

source: If you're interested in the configuration, the `make` commands are defined in the [`Makefile`](/Makefile).
fr: Si la configuration vous intéresse, les commandes `make' sont définies dans le fichier [`Makefile`](/Makefile).

source: If you need to use a different tag image (default is `alpine`), you can set the `TAG` environment variable:
fr: Si vous avez besoin d'utiliser une image Docker identifiée par un tag différent (par défaut `alpine`), vous pouvez surcharger de la manière suivante la variable d'environnement `TAG` au moment de l'exécution de la commande :

source: You can find the full list of available tags [on the Docker hub](https://hub.docker.com/r/freshrss/freshrss/tags).
fr: Vous pouvez trouver la liste complète des tags disponibles [sur le hub Docker](https://hub.docker.com/r/freshrss/freshrss/tags).

source: If you want to build the Docker image yourself, you can use the following command:
fr: Si vous voulez construire l'image Docker, vous pouvez lancer la commande suivante :

source: $ make build $ # or $ TAG=arm make build
fr: $ make build $ # ou $ TAG=arm make build

source: The `TAG` variable can be anything (e.g. `local`). You can target a specific architecture by adding `-alpine` or `-arm` at the end of the tag (e.g. `local-arm`).
fr: La valeur de la variable `TAG` peut contenir n'importe quelle valeur (par exemple `local`). Vous pouvez cibler une architecture spécifique en ajoutant `-alpine` ou `-arm` à la fin du tag (par exemple `local-arm`).

source: Project architecture
fr: Architecture du projet

source: **TODO**
fr: **À FAIRE**

source: If you want to create your own FreshRSS extension, take a look at the [extension documentation](03_Backend/05_Extensions.md).
fr: Si vous souhaitez créer votre propre extension FreshRSS, consultez la [documentation de l'extension](03_Backend/05_Extensions.md).

source: Coding style
fr: Style de codage

source: If you want to contribute to the source code, it's important to follow the project's coding style. The actual code doesn't always follow it throughout the project, but we should fix it every time an opportunity presents itself.
fr: Si vous désirez contribuer au code, il est important de respecter le style de codage suivant. Le code actuel ne le respecte pas entièrement mais il est de notre devoir à tous de le changer dès que l'occasion se présente.

source: Contributions which don't follow the coding style will be rejected as long as the coding style is not fixed.
fr: Aucune nouvelle contribution ne respectant pas ces règles ne sera acceptée tant que les corrections nécessaires ne sont pas appliquées.

source: Spaces, tabs and other whitespace characters
fr: Espaces, tabulations et autres caractères blancs

source: Code indentation must use tabs.
fr: L'indentation du code doit être faite impérativement avec des tabulations.

source: Alignment
fr: Alignement

source: Once the code has been correctly indented, it might be useful to align it for ease of reading. In that case, please use spaces.
fr: Une fois l'indentation faite, il peut être nécessaire de faire un alignement pour simplifier la lecture. Dans ce cas, il faut utiliser les espaces.

source: $result = a_function_with_a_really_long_name($param1, $param2, $param3, $param4);
fr: $resultat = une_fonction_avec_un_nom_long($param1, $param2, $param3, $param4);

source: End of line
fr: Fin de ligne

source: The newline character must be a line feed (LF), which is the default line ending on *NIX systems. This character must not follow other white space.
fr: Le caractère de fin de ligne doit être un saut de ligne (LF) qui est le caractère de fin de ligne des systèmes *NIX. Ce caractère ne doit pas être précédé par des caractères blanc.

source: You can verify if there is any unintended white space at the end of line with the following Git command:
fr: Il est possible de vérifier la présence de caractères blancs en fin de ligne grâce à Git avec la commande suivante :

source: # command to check files before adding them in the Git index git diff --check # command to check files after adding them in the Git index git diff --check --cached
fr: # commande à lancer avant l'ajout des fichiers dans l'index git diff --check # commande à lancer après l'ajout des fichiers dans l'index mais avant le commit git diff --check --cached

source: End of file
fr: Fin de fichier

source: Every file must end by an empty line.
fr: Chaque fichier doit se terminer par une ligne vide.

source: Commas, dots and semi-columns
fr: Le cas de la virgule, du point et du point-virgule

source: There should no space before those characters, but there should be one after.
fr: Il n'y a pas d'espace avant ces caractères, il y en a un après.

source: Operators
fr: Le cas des opérateurs

source: There should be a space before and after every operator.
fr: Chaque opérateur est entouré d'espaces.

source: if ($a == 10) { // do something } echo $a ? 1 : 0;
fr: if ($a == 10) { // faire quelque chose } echo $a ? 1 : 0;

source: Parentheses
fr: Le cas des parenthèses

source: There should be no spaces in between brackets. There should be no spaces before the opening bracket, except if it's after a keyword. There shouldn't be any spaces after the closing bracket, except if it's followed by a curly bracket.
fr: Il n'y a pas d'espaces entre des parenthèses. Il n'y a pas d'espaces avant une parenthèse ouvrante sauf si elle est précédée d'un mot-clé. Il n'y a pas d'espaces après une parenthèse fermante sauf si elle est suivie d'une accolade ouvrante.

source: if ($a == 10) { // do something } if ((int)$a == 10) { // do something }
fr: if ($a == 10) { // faire quelque chose } if ((int)$a == 10) { // faire quelque chose }

source: With chained functions
fr: Le cas des fonctions chainées

source: It happens most of the time in Javascript files. When there are chained functions with closures and callback functions, it's hard to understand the code if not properly formatted. In those cases, we add a new indent level for the complete instruction and reset the indent for a new instruction on the same level.
fr: Ce cas se présente le plus souvent en Javascript. Quand on a des fonctions chainées, des fonctions anonymes ainsi que des fonctions de rappels, il est très facile de se perdre. Dans ce cas là, on ajoute une indentation supplémentaire pour toute l'instruction et on revient au même niveau pour une instruction de même niveau.

source: // First instruction shortcut.add(shortcuts.mark_read, function () { //... }, { 'disable_in_input': true }); // Second instruction shortcut.add("shift+" + shortcuts.mark_read, function () { //... }, { 'disable_in_input': true });
fr: // Première instruction shortcut.add(shortcuts.mark_read, function () { //... }, { 'disable_in_input': true }); // Deuxième instruction shortcut.add("shift+" + shortcuts.mark_read, function () { //... }, { 'disable_in_input': true });

source: Line length
fr: Longueur des lignes

source: Lines should strive to be shorter than 80 characters. However, this limit may be extended to 100 characters when strictly necessary.
fr: Les lignes ne doivent pas dépasser 80 caractères. Il est cependant autorisé exceptionnellement de dépasser cette limite s'il n'est pas possible de la respecter mais en aucun cas, les lignes ne doivent dépasser les 100 caractères.

source: With functions, parameters can be declared on multiple lines.
fr: Dans le cas des fonctions, les paramètres peuvent être déclarés sur plusieurs lignes.

source: function my_function($param_1, $param_2, $param_3, $param_4) { // do something }
fr: function ma_fonction($param_1, $param_2, $param_3, $param_4) { // faire quelque chose }

source: Naming
fr: Nommage

source: All code elements (functions, classes, methods and variables) must describe their usage succinctly.
fr: L'ensemble des éléments du code (fonctions, classes, méthodes et variables) doivent être nommés de manière à décrire leur usage de façon concise.

source: Functions and variables
fr: Fonctions et variables

source: Functions and variables must follow the "snake case" naming convention.
fr: Les fonctions et les variables doivent suivre la convention "snake case".

source: // a function function function_name() { // do something } // a variable $variable_name;
fr: // une fontion function nom_de_la_fontion() { // faire quelque chose } // une variable $nom_de_la_variable;

source: Methods
fr: Méthodes

source: Methods must follow the "lower camel case" naming convention.
fr: Les méthodes doivent suivre la convention "lower camel case".

source: private function methodName() { // do something }
fr: private function nomDeLaMethode() { // faire quelque chose }

source: Classes must follow the "upper camel case" naming convention.
fr: Les classes doivent suivre la convention "upper camel case".

source: abstract class ClassName {}
fr: abstract class NomDeLaClasse {}

source: Encoding
fr: Encodage

source: Files must be encoded with the UTF-8 character set.
fr: Les fichiers doivent être encodés en UTF-8.

source: PHP compatibility
fr: Compatibilité PHP

source: Please ensure that your code works with the oldest PHP version officially supported by FreshRSS.
fr: Assurez-vous que votre code fonctionne avec une version de PHP aussi ancienne que celle que FreshRSS supporte officiellement.

source: Miscellaneous
fr: Divers

source: Operators must be at the end of the line if a condition is split over more than one line.
fr: Les opérateurs doivent être en fin de ligne dans le cas de conditions sur plusieurs lignes.

source: if ($a == 10 || $a == 20) { // do something }
fr: if ($a == 10 || $a == 20) { // faire quelque chose }

source: If the file contains only PHP code, the PHP closing tag must be omitted.
fr: Si le fichier ne contient que du PHP, il ne doit pas comporter de balise fermante.

source: Arrays
fr: Tableaux

source: If an array declaration runs on more than one line, each element must be followed by a comma, including the last one.
fr: Lors de l'écriture de tableaux sur plusieurs lignes, tous les éléments doivent être suivis d'une virgule (même le dernier).

source: $variable = [ "value 1", "value 2", "value 3", ];
fr: $variable = [ "valeur 1", "valeur 2", "valeur 3", ];

source: Reporting a bug or a suggestion
fr: Remonter un problème ou une suggestion

source: Despite the care given to FreshRSS, it's still possible that bugs occur. The project is young and development is dynamic, so it can be corrected quickly. You might also have a feature in mind that doesn't yet exist. Regardless whether your idea seems silly, far-fetched, useless or too specific, please don't hesitate to propose it to us! "Ideas in the air" often find an attentive ear. It's new external perspectives that make the project evolve the most.
fr: Malgré le soin apporté à FreshRSS, il se peut que des bugs apparaissent encore. Le projet est jeune et le développement dynamique, aussi celui-ci pourra être corrigé rapidement. Il se peut aussi que vous ayez en tête une fonctionnalité qui n'existe pas encore. Que celle-ci vous paraisse idiote, farfelue, inutile ou trop spécifique, il ne faut surtout pas hésiter à nous la proposer ! Très souvent des "idées en l'air" ont trouvé une oreille attentive. Ce sont les regards externes qui font le plus évoluer le projet.

source: If you're convinced that you should be heard, here's how you can go about it.
fr: Si vous êtes convaincus qu'il faut vous faire entendre, voici la marche à suivre.

source: On GitHub
fr: Sur GitHub

source: GitHub is the ideal platform to submit your requests. It allows us to discuss a problem or suggestion with others and it often generates new ideas. Let's not neglect this "social" aspect!
fr: GitHub est la plate-forme à privilégier pour vos demandes. En effet, cela nous permet de pouvoir discuter à plusieurs sur un problème ou une suggestion et de faire émerger, souvent, des idées nouvelles. Ne négligeons pas cet aspect "social" !
