Repository: FreshRSS/FreshRSS
Catalog: docs/i18n/freshrss.*.po
Languages: fr

source: Available languages are: cz, de, en, es, fr, he, it, kr, nl, oc, pt-br, ru, tr, zh-cn.
fr: Les langues disponibles sont : cz, de, en, es, fr, he, it, kr, nl, oc, pt-br, ru, tr, zh-cn.

source: Theme
fr: Thème

source: There's no accounting for tastes, which is why FreshRSS offers eight official themes:
fr: Les goûts et les couleurs, ça ne se discute pas. C'est pourquoi FreshRSS propose huit thèmes officiels :

source: *Blue Lagoon* by **Mister aiR**
fr: *Blue Lagoon* par **Mister aiR**

source: *Dark* by **AD**
fr: *Dark* par **AD**

source: *Flat design* by **Marien Fressinaud**
fr: *Flat design* par **Marien Fressinaud**

source: *Origine* by **Marien Fressinaud**
fr: *Origine* par **Marien Fressinaud**

source: *Origine-compact* by **Kevin Papst**
fr: *Origine-compact* par **Kevin Papst**

source: *Pafat* by **Plopoyop**
fr: *Pafat* par **Plopoyop**

source: *Screwdriver* by **Mister aiR**
fr: *Screwdriver* par **Mister aiR**

source: *Swage* by **Patrick Crandol**
fr: *Swage* par **Patrick Crandol**

source: If you can't find any themes you like, it's always possible to [create your own](../developers/04_Frontend/02_Design.md).
fr: Si aucun de ceux proposés ne convient, il est toujours possible de [créer son propre thème](../developers/04_Frontend/02_Design.md).

source: To select a theme, simply scroll through the themes and select one that strikes your fancy. After confirmation, the theme will be applied to the interface.
fr: Pour sélectionner un thème, il suffit de faire défiler les thèmes jusqu'à l'apparition du thème choisi. Après validation, le thème sera appliqué à l'interface.

source: Content width
fr: Largeur du contenu

source: Some people prefer short lines of text, while others prefer to maximize the available screen space. To satisfy the maximum number of people, it's possible to customize the width of the displayed content. There are four settings available:
fr: Il y en a qui préfère des lignes de texte courtes, d'autres qui préfèrent maximiser l'espace disponible sur l'écran. Pour satisfaire le maximum de personne, il est possible de choisir la largeur du contenu affiché. Il y a quatre réglages disponibles :

source: **Fine** displays content up to a maximum width of 550 pixels
fr: **Fine** qui affiche le contenu jusqu'à 550 pixels

source: **Medium** displays content up to a maximum width of 800 pixels
fr: **Moyenne** qui affiche le contenu jusqu'à 800 pixels

source: **Large** displays content up to a maximum width of 1000 pixels
fr: **Large** qui affiche le contenu jusqu'à 1000 pixels

source: **No limit** displays the content on 100% of the available space
fr: **Pas de limite** qui affiche le contenu sur 100% de la place disponible

source: Article icons
fr: Icônes d'article

source: Please note that this section only affects normal view.
fr: Veuillez noter que cette section n'affecte que la vue normale.

source: ![Article icons configuration](../img/users/configuration.article.icons.png)
fr: ![Configuration des icônes d'article](../img/users/configuration.article.icons.png)

source: Each article is rendered with a header (top line) and a footer (bottom line). In that section, you can choose what will be displayed in those.
fr: Chaque article est rendu avec un en-tête (ligne supérieure) et un pied de page (ligne inférieure). Dans cette section, vous pouvez choisir ce qui sera affiché dans ceux-ci.

source: If you disable every item in the top line, you'll still be able to see it since it contains the feed name and the article title. But if you do the same thing for the bottom line, it will be empty.
fr: Si vous désactivez tous les éléments de la ligne supérieure, vous pourrez toujours les voir, puisqu'il contient le nom du flux et le titre de l'article. Mais si vous faites le même chose pour la ligne inférieure, elle sera vide.

source: HTML5 notification timout
fr: Temps d'affichage de la notification HTML5

source: After automatically updating the feeds, FreshRSS can pop up a notification using the HTML5 notification API.
fr: Après la mise à jour automatique des flux, FreshRSS utilise l'API de notification de HTML5 pour avertir de l'arrivée de nouveaux articles.

source: The duration of this notification can be set. By default, the value is 0.
fr: Il est possible de régler la durée d'affichage de cette notification. Par défaut, la valeur est 0.

source: Archival
fr: Archivage

source: Sharing
fr: Partage

source: To make your life easier, you can share articles straight from FreshRSS.
fr: Pour vous faciliter la vie, vous pouvez partager des articles directement via FreshRSS.

source: To add a new item to the list, please follow the following simple steps:
fr: Pour ajouter un nouvel élément à la liste, veuillez suivre les étapes simples ci-dessous :

source: Shortcuts
fr: Raccourcis

source: More information can be found in the [Apache documentation](http://httpd.apache.org/docs/trunk/howto/auth.html#gettingitworking).
fr: Plus d'informations dans [la documentation d'Apache.](http://httpd.apache.org/docs/trunk/howto/auth.html#gettingitworking)

source: Subscription management
fr: Gestion des flux

source: Information
fr: Informations

source: Login
fr: Identification

source: Advanced
fr: Avancé

source: Retrieve a truncated stream from within FreshRSS
fr: Récupérer un flux tronqué à partir de FreshRSS

source: This question comes up regularly, so we'll try to clarify how one can retrieve a truncated RSS feed with FreshRSS. Please note that the process is absolutely not user friendly, but it works. :)
fr: La question revient régulièrement, je vais essayer de clarifier ici comment on peut récupérer un flux RSS tronqué avec FreshRSS. Sachez avant tout que la manière de s'y prendre n'est absolument pas "user friendly", mais elle fonctionne. :)

source: Please be aware that this way you'll generate much more traffic to the originating sites, and they might block you accordingly. FreshRSS performance is also negatively affected, because you'll have to fetch the full article content one by one. So it's a feature to use sparingly!
fr: Sachez aussi que par cette manière vous générez beaucoup plus de trafic vers les sites d'origines et qu'ils peuvent vous bloquer par conséquent. Les performances de FreshRSS sont aussi moins bonnes car vous devez alors aller chercher le contenu des articles un par un. C'est donc une fonctionnalité à utiliser avec parcimonie !

source: What's meant by "CSS path of articles on the original site" actually corresponds to the "path" consisting of IDs and classes (which in HTML, matches the id and class attributes) to retrieve only the interesting part that corresponds to the article. Ideally, this path starts with an id (which is unique to the page).
fr: Ce que j'entends par "Chemin CSS des articles sur le site d’origine" correspond en fait au "chemin" constitué par les IDs et les classes (en html, correspond aux attributs id et class) pour récupérer uniquement la partie intéressante qui correspond à l'article. L'idéal est que ce chemin commence par un id (qui est unique pour la page).

source: Example: Rue89
fr: Exemple : Rue89

source: To find this path, you have to go to the address of one of the truncated articles (for example, http://www.rue89.com/2013/10/15/prof-maths-jai-atteint-lextase-dihn-pedagogie-inversee-246635). You look have to look for the "block" of HTML that corresponds to article content (in the source code!).
fr: Pour trouver ce chemin, il faut se rendre à l'adresse d'un des articles tronqués (par exemple http://www.rue89.com/2013/10/15/prof-maths-jai-atteint-lextase-dihn-pedagogie-inversee-246635). Il faut alors chercher le "bloc" HTML correspondant au contenu de l'article (dans le code source !)

source: Here we find that the block that encompasses nothing but the content of the article is ```<div class="content clearfix">```. We'll only use the `.content` class here. Nevertheless, as said above, it's best to start the path with an id. If we go back to the parent block, we find ```<div id="article">``` and that's perfect! The path will be ```#article .content```.
fr: On trouve ici que le bloc qui englobe uniquement le contenu de l'article est ```<div class="content clearfix">```. On ne va garder que la classe `.content` ici. Néanmoins, comme je le disais plus haut, il est préférable de commencer le chemin avec un id. Si on remonte au bloc parent, il s'agit du bloc ```<div id="article">``` et c'est parfait ! Le chemin sera donc ```#article .content```.

source: Add the corresponding classes to the article CSS path on the feed configuration page. Examples:
fr: Liste de correspondances site → chemin css

source: Retrieve a truncated stream with external tools
fr: Récupérer un flux tronqué à l'aide d'outils externes

source: Complimentary tools can be used to retrieve full article content, such as:
fr: Des outils complémentaires peuvent être utilisés pour récupérer le contenu complet d'un article, comme :

source: FreshRSS - Fever API implementation
fr: FreshRSS - API compatible Fever

source: See the [page about our Google Reader compatible API](06_Mobile_access.md) for another possibility and general aspects of API access.
fr: Voir la page [sur notre API compatible Google Reader](06_Mobile_access.md) pour une autre possibilité et des généralités sur l’accès par API.

source: RSS clients
fr: Clients compatibles

source: There are many RSS clients that support the Fever API, but they seem to understand the Fever API a bit differently. If your favourite client doesn't work properly with this API, please create an issue and we'll have a look. But we can **only** do that for free clients.
fr: De nombreux clients RSS prennent en charge l'API Fever, mais ils semblent comprendre l'API Fever un peu différemment. Si votre client préféré ne fonctionne pas correctement avec cette API, veuiller créer un ticket et nous y jetterons un oeil. Mais nous ne pouvons le faire que pour les clients gratuits.

source: Usage & Authentication
fr: Utilisation et authentification

source: Before you can start using this API, you have to enable and setup API access, which is [documented here](https://freshrss.github.io/FreshRSS/en/users/06_Mobile_access.html), and then reset the user’s API password.
fr: Avant de pouvoir commencer à utiliser cette API, vvous devez activer et configurer l'accès à l'API, qui est [documenté ici](https://freshrss.github.io/FreshRSS/en/users/06_Mobile_access.html), et réinitialisez ensuite le mot de passe API de l'utilisateur.

source: Then point your mobile application to the `fever.php` address (e.g. `https://freshrss.example.net/api/fever.php`).
fr: Connectez ensuite votre application mobile en utilisant l'adresse de l'API (e.g. `https://freshrss.example.net/api/fever.php`).

source: Compatible clients
fr: Clients compatibles

source: Tested with:
fr: Testé avec :

source: * Android * [Readably](https://play.google.com/store/apps/details?id=com.isaiasmatewos.readably) (Closed source)
fr: * Android * [Readably](https://play.google.com/store/apps/details?id=com.isaiasmatewos.readably) (Propriétaire)

source: * iOS * [Fiery Feeds](https://apps.apple.com/app/fiery-feeds-rss-reader/id1158763303) (Closed source) * [Unread](https://apps.apple.com/app/unread-rss-reader/id1252376153) (Commercial) * [Reeder](https://www.reederapp.com/) (Commercial) (Use its Google Reader API / native FreshRSS option when possible)
fr: * iOS * [Fiery Feeds](https://apps.apple.com/app/fiery-feeds-rss-reader/id1158763303) (Propriétaire) * [Unread](https://apps.apple.com/app/unread-rss-reader/id1252376153) (Commercial) * [Reeder](https://www.reederapp.com/) (Commercial) (Connectez-vous plutôt par son option Google Reader API)

source: Features
fr: Fonctionnalités

source: The following features are implemented:
fr: Les fonctionnalités suivantes sont implémentées :

source: fetching categories
fr: récupération des catégories

source: fetching feeds
fr: récupération des flux

source: fetching RSS items (new, favorites, unread, by_id, by_feed, by_category, since)
fr: récupération des entrées (new, favorites, unread, by_id, by_feed, by_category,since)

source: fetching favicons
fr: récupération des favicons

source: setting read marker for item(s)
fr: marquage des entrées comme lues

source: setting starred marker for item(s)
fr: marquage des entrées comme favoris

source: setting read marker for feed
fr: marquage d'un flux comme lu

source: setting read marker for category
fr: marquage d'une catégorie comme lue

source: supports FreshRSS extensions, which use the `entry_before_display` hook
fr: support des extensions grace au hook `entry_before_display`

source: The following features are not supported:
fr: Les fonctionnalités suivantes ne sont pas implémentées :

source: **Hot Links** aka **hot** as there is nothing in FreshRSS yet that is similar or could be used to simulate it.
fr: « Hot Links » car il n'y a encore rien dans FreshRSS qui soit similaire ou qui puisse être utilisé pour le simuler.

source: Testing and debugging
fr: Tester et déboguer

source: If this API does not work as expected in your RSS reader, you can test it manually with a tool like [Postman](https://www.getpostman.com/).
fr: Si l'API ne fonctionne pas comme attendu dans votre lecteur, il est possible de la tester manuellement avec un outil tel que [Postman](https://www.getpostman.com/).

source: Configure a POST request to the URL https://freshrss.example.net/api/fever.php?api which should give you the result:
fr: Envoyer une requête POST à l'adresse https://freshrss.example.net/api/fever.php?api devrait vous renvoyer le résultat suivant :

source: Great, the base setup seems to work!
fr: Super, la configuration de base fonctionne !

source: Now lets try an authenticated call. Fever uses an `api_key`, which is the MD5 hash of `"$username:$apiPassword"`. Assuming the user is `kevin` and the password `freshrss`, here is a command-line example to compute the resulting `api_key`
fr: Maintenant essayons de faire un appel authentifié. Fever utilise un paramètre `api_key` qui contient le résultat de la fonction de hachage MD5 de la valeur `"$username:$apiPassword"`. En considérant que l'utilisateur est `kevin` et que son mot de passe est `freshrss`, voici la commande à lancer pour calculer la valeur du paramètre `api_key` :

source: Add a body to your POST request encoded as `form-data` and one key named `api_key` with the value `your-password-hash`:
fr: Ajoutez un contenu sous forme de `form-data`à votre requête POST ainsi que le paramètre `api_key` contenant la valeur calculée à l'étape précédente :

source: curl -s -F "api_key=$api_key" 'https://freshrss.example.net/api/fever.php?api'
fr: curl -s -F "api_key=$api_key" 'https://freshrss.exemple.net/api/fever.php?api'

source: This should give:
fr: Vous devriez obtenir le résultat suivant :

source: Perfect, you're now authenticated and you can start testing the more advanced features. To do so, change the URL and append the possible API actions to your request parameters. Please refer to the [original Fever documentation](https://feedafever.com/api) for more information.
fr: Parfait, maintenant vous êtes autentifié et vous pouvez commencer à tester les fonctions avancées. Pour cela, il suffit de changer l'adresse en lui ajoutant les paramètres nécessaires à la réalisation des actions supportées. Pour plus d'information, veuillez vous référer à la [documentation officielle de Fever](https://feedafever.com/api).

source: Some basic calls are:
fr: Voici quelques exemples simples d'appels réalisables :

source: Replace `some_id` with a real ID from your `freshrss_username_entry` database.
fr: Remplacez `some_id` par un identifiant réel de votre base de données `freshrss_username_entry`.

source: Debugging
fr: Déboguer

source: If nothing helps and your client is still misbehaving, you can add the following lines to the beginning of the `fever.api` file to determine the cause of the problems:
fr: Si rien ne fonctionne correctement et que votre client se comporte étrangement, vous pouvez ajouter les quelques lignes suivantes au début du fichier `fever.api` pour déterminer la cause des problèmes rencontrés :

source: Then use your RSS client to query the API and afterwards check the file `fever.log`.
fr: Utilisez ensuite votre client RSS pour interroger l'API et vérifier le fichier `fever.log`.

source: Credits
fr: Remerciements

source: This plugin was inspired by the [tinytinyrss-fever-plugin](https://github.com/dasmurphy/tinytinyrss-fever-plugin).
fr: Ce plugin a été inspiré par le [tinytinyrss-fever-plugin](https://github.com/dasmurphy/tinytinyrss-fever-plugin).

source: This page assumes you have completed the [server setup](../admins/02_Installation.md).
fr: Cette page suppose que vous ayez fini [l’installation du serveur](01_Installation.md).

source: Enable the API in FreshRSS
fr: Activer l’API dans FreshRSS

source: Under the section “Authentication”, enable the option “Allow API access (required for mobile apps)”.
fr: Dans la section “Authentification”, cocher l’option “Autoriser l’accès par API (nécessaire pour les applis mobiles)”.

source: 2. Under the section “Profile”, fill-in the field “API password (e.g., for mobile apps)”. * Every user must define an API password. * The reason for an API-specific password is that it may be used in less safe situations than the main password, and does not grant access to as many things.
fr: 2. Dans la section “Profil”, remplir le champ “Mot de passe API (ex. : pour applis mobiles)”. * Chaque utilisateur doit choisir son mot de passe API. * La raison d’être d’un mot de passe API différent du mot de passe principal est que le mot de passe API est potentiellement utilisé de manière moins sûre, mais il permet aussi moins de choses.

source: The rest of this page is about the Google Reader compatible API. See the [page about the Fever compatible API](06_Fever_API.md) for another possibility.
fr: Le reste de cette page concerne l’API compatible Google Reader. Voir la [page sur l’API compatible Fever](06_Fever_API.md) pour une autre possibilité.

source: Testing
fr: Tester

source: Under the section “Profile”, click on the link like `https://rss.example.net/api/` next to the field “API password”.
fr: Dans la section “Profil”, cliquer sur le lien de la forme `https://rss.example.net/api/` à côté du champ “Mot de passe API”.

source: 4. Click on first link “Check full server configuration”: * If you get *PASS* then you are done, all is good: you may proceed to step 6. * If you get *Bad Request!* or *Not Found*, then your server probably does not accept slashes `/` that are escaped `%2F`. Proceed to step 5. * If you get any other error message, proceed to step 5.
fr: 4. Cliquer sur le premier lien “Check full server configuration”: * Si vous obtenez `PASS`, tout est bon : passer à l’étape 6. * Si vous obtenez *Bad Request!* ou *Not Found*, alors votre serveur ne semble pas accepter les slashs `/` qui sont encodés `%2F`. Passer à l’étape 5. * Si vous obtenez un autre message d’erreur, passer à l’étape 5.

source: Fix server configuration
fr: Déboguer la configuration du serveur

source: 5. Click on the second link “Check partial server configuration (without `%2F` support)”: * If you get `PASS`, then the problem is indeed that your server does not accept slashes `/` that are escaped `%2F`. * With Apache, remember the directive [`AllowEncodedSlashes On`](http://httpd.apache.org/docs/trunk/mod/core.html#allowencodedslashes) * Or use a client that does not escape slashes (such as EasyRSS), in which case proceed to step 6. * If you get *Service Unavailable!*, then check from step 1 again. * With __Apache__: * If you get *FAIL getallheaders!*, the combination of your PHP version and your Web server does not provide access to [`getallheaders`](http://php.net/getallheaders) * Turn on Apache `mod_setenvif` (often enabled by default), or `mod_rewrite` with the following procedure: * Allow [`FileInfo` in `.htaccess`](http://httpd.apache.org/docs/trunk/mod/core.html#allowoverride): see the [server setup](../admins/02_Installation.md) again. * Enable [`mod_rewrite`](http://httpd.apache.org/docs/trunk/mod/mod_rewrite.html): * With Debian / Ubuntu: `sudo a2enmod rewrite` * With __nginx__: * If you get *Bad Request!*, check your server `PATH_INFO` configuration. * If you get *File not found!*, check your server `fastcgi_split_path_info`. * If you get *FAIL 64-bit or GMP extension!*, then your PHP version does not pass the requirement of being 64-bit and/or have PHP [GMP](http://php.net/gmp) extension. * The easiest is to add the GMP extension. On Debian / Ubuntu: `sudo apt install php-gmp` * Update and try again from step 3.
fr: 5. Cliquer sur le second lien “Check partial server configuration (without `%2F` support)”: * Si vous obtenez `PASS`, alors le problème est bien que votre serveur n’accepte pas les slashs `/` qui sont encodés `%2F`. * Avec Apache, vérifiez la directive [`AllowEncodedSlashes On`](http://httpd.apache.org/docs/trunk/mod/core.html#allowencodedslashes) * Ou utilisez un client qui n’encode pas les slashs (comme EasyRSS), auquel cas passer à l’étape 6. * Si vous obtenez *Service Unavailable!*, retourner à l’étape 6. * Avec __Apache__: * Si vous obtenez *FAIL getallheaders!*, alors la combinaison de votre version de PHP et de votre serveur Web ne permet pas l’accès à [`getallheaders`](http://php.net/getallheaders) * Activer Apache `mod_setenvif` (souvent activé par défault), ou `mod_rewrite` avec la procédure suivante : * Autoriser [`FileInfo` dans `.htaccess`](http://httpd.apache.org/docs/trunk/mod/core.html#allowoverride) : revoir [l’installation du serveur](01_Installation.md). * Activer [`mod_rewrite`](http://httpd.apache.org/docs/trunk/mod/mod_rewrite.html) : * Sur Debian / Ubuntu : `sudo a2enmod rewrite` * Avec __nginx__: * Si vous obtenez *Bad Request!*, vérifier la configuration `PATH_INFO` de votre serveur. * Si vous obtenez *File not found!*, vérifier la configuration `fastcgi_split_path_info` de votre serveur. * Si vous obtenez *FAIL 64-bit or GMP extension!*, alors votre installation PHP soit n’est pas en 64 bit, soit n’a pas l’extension PHP [GMP](http://php.net/gmp) activée. * Le plus simple est d’activer l’extension GMP. Sur Debian / Ubuntu : `sudo apt install php-gmp` * Mettre à jour et retourner à l’étape 3.

source: 6. On the same FreshRSS API page, note the address given under “Your API address”, like `https://freshrss.example.net/api/greader.php` * Type the API address in a client, together with your FreshRSS username, and the corresponding special API password.
fr: 6. Sur la même page de l'API FreshRSS, notez l'adresse donnée sous "Votre adresse API", comme `https://freshrss.example.net/api/greader.php` * Saisissez l'adresse de l'API dans le client sélectionné puis votre nom d'utilisateur et votre mot de passe spécialement créé pour l'API.
