Repository: FreshRSS/FreshRSS
Catalog: docs/i18n/freshrss.*.po
Languages: fr

source: [Go to the bug ticket manager](https://github.com/FreshRSS/FreshRSS/issues)
fr: [Rendez-vous sur le gestionnaire de tickets de bugs](https://github.com/FreshRSS/FreshRSS/issues)

source: Start by checking if a similar request hasn't already been made. If so, please feel free to add your voice to the request.
fr: Commencez par rechercher si une demande similaire n'a pas déjà été faite. Si oui, n'hésitez pas à ajouter votre voix à la demande.

source: If your request is new, [open a new bug ticket](https://github.com/FreshRSS/FreshRSS/issues/new)
fr: Si votre demande est nouvelle, [ouvrez un nouveau ticket de bug](https://github.com/FreshRSS/FreshRSS/issues/new)

source: Finally, write your request. If you're fluent in English, it's the preferred language because it allows for discussion with the largest number of people.
fr: Rédigez enfin votre demande. Si vous maitrisez l'anglais, c'est la langue à privilégier car cela permet d'ouvrir la discussion à un plus grand nombre de personnes. Sinon, ce n'est pas grave, continuez en français :)

source: Please follow the tips below to make it easier to let your ticket be heard.
fr: Merci de bien vouloir suivre les quelques conseils donnés plus bas pour faciliter la prise en compte de votre ticket.

source: Informal
fr: De façon informelle

source: Not everyone likes or uses GitHub for a variety of legitimate reasons. That is why you can also contact us in a more informal way.
fr: Tout le monde n'aime pas ou n'utilise pas GitHub pour des raisons aussi diverses que légitimes. C'est pourquoi vous pouvez aussi nous contacter de façon plus informelle.

source: On [our Mattermost chat](https://framateam.org/signup_user_complete/?id=e2680d3e3128b9fac8fdb3003b0024ee)
fr: Sur [notre chat Mattermost](https://framateam.org/signup_user_complete/?id=e2680d3e3128b9fac8fdb3003b0024ee)

source: On [the mailing lists](https://freshrss.org/announce-of-the-mailing-lists.html)
fr: Sur [les listes de diffusion](https://freshrss.org/announce-of-the-mailing-lists.html)

source: At events / meetings around Free Software
fr: À des évènements / rencontres autour du Logiciel Libre

source: Over a beer in a bar
fr: Autour d'une bière dans un bar

source: Tips
fr: Conseils

source: Here are some tips to help you present your bug report or suggestion:
fr: Voici quelques conseils pour bien présenter votre remontée de bug ou votre suggestion :

source: **Pay attention to spelling**. Even if it's not always easy, try your best!
fr: **Faites attention à l'orthographe.** même si ce n'est pas toujours facile, faites votre maximum. ;)

source: **Give an explicit title to your request**, even if it's a bit long. This not only helps us understand your request, but also to find your ticket later.
fr: **Donnez un titre explicite à votre demande**, quitte à ce qu'il soit un peu long. Cela nous aide non seulement à comprendre votre demande, mais aussi à retrouver votre ticket plus tard.

source: **One request = one ticket.** You may have lots of ideas while being afraid to spam the bug manager: it doesn't matter. It's better to have a few too many tickets than too many requests in one. We'll close and consolidate requests when possible.
fr: **Une demande = un ticket.** Vous pouvez avoir des tas d'idées mais vous avez peur de spammer le gestionnaire de bugs : ça ne fait rien. Il vaut mieux avoir un peu trop de tickets que trop de demandes dans un seul. On s'occupera de fermer et regrouper les demandes qui le peuvent.

source: If you report a bug, think about **providing us with the FreshRSS logs** (accessible in the FreshRSS `data/log/` folder) and the **PHP logs** (the location may vary by distribution, but consider searching in `/var/log/httpd` or `/var/log/apache`).
fr: Si vous remontez un bug, pensez à nous **fournir les logs de FreshRSS** (accessibles dans les dossier ''data/log/'' de FreshRSS) **et PHP** (l'emplacement peut varier selon les distributions, mais pensez à chercher dans ''/var/log/httpd'' ou ''/var/log/apache'').

source: If you can't find the log files, specify it in your ticket so we know you've already searched.
fr: Si vous ne trouvez pas les fichiers de logs, précisez-le dans votre ticket afin que nous sachions que vous avez déjà cherché.

source: Not all bugs require logs, but if you have any doubts, it is better to provide them to us. Logs are important and very useful for debugging!
fr: Tous les bugs ne nécessitent pas les logs, mais si vous doutez, mieux vaut nous les fournir. Les logs sont importants et très utiles pour débugguer !

source: The logs may reveal confidential information, so **be careful not to disclose anything sensitive.**
fr: Il se peut que les logs puissent révéler des informations plus ou moins confidentielles, **faites attention à ne rien divulguer de sensible.**

source: In addition, when facing a bug, you're encouraged to follow this message format (from the [Sam & Max website](http://sametmax.com/template-de-demande-daide-en-informatique/):
fr: De plus, face à un bug, je ne peux que vous encourager à suivre le format de message suivant (tiré du [site de Sam & Max](http://sametmax.com/template-de-demande-daide-en-informatique/)) :

source: What's my goal?
fr: Quel est mon objectif ?

source: Give the general context of what you were trying to do.
fr: Donnez le contexte général de ce que vous essayiez de faire.

source: What have I been trying to do?
fr: Qu’est-ce que j’ai essayé de faire ?

source: Explain step by step what you have done so that we can reproduce the bug.
fr: Expliquez pas à pas ce que vous avez fait afin que nous puissions reproduire le bug.

source: What results have I achieved?
fr: Quels résultats ai-je obtenus ?

source: The bug: what you see that shouldn't have happened. Here you can provide the logs.
fr: Le bug : ce que vous voyez qui n'aurez pas dû se passer. Ici vous pouvez fournir les logs.

source: What was the expected result?
fr: Quel était le résultat attendu ?

source: So that we understand what you consider to be the problem.
fr: Afin que nous comprenions bien où est le problème... au moins selon vous :p

source: What are my circumstances?
fr: Quelle est ma situation ?

source: Remember to give the following information if you know it:
fr: Pensez à donner les informations suivantes si vous les connaissez :

source: Which browser? Which version?
fr: Quel navigateur ? Quelle version ?

source: Which server: Apache, Nginx? Which version?
fr: Quel serveur : Apache, Nginx ? Quelle version ?

source: Which version of PHP?
fr: Quelle version de PHP ?

source: Which database: SQLite, MySQL, MariaDB, PostgreSQL? Which version?
fr: Quelle base de données : SQLite, MySQL, MariaDB, PostgreSQL ? Quelle version ?

source: Which distribution runs on the server? And... which version?
fr: Quelle distribution sur le serveur ? Et… quelle version ?

source: Branching
fr: Système de branches

source: Basic
fr: Élémentaire

source: If you are new to Git, here are some of the resources you might find useful:
fr: Si vous êtes novice dans Git, voici quelques ressources qui pourraient vous être utiles :

source: [GitHub's blog post](https://github.com/blog/120-new-to-git)
fr: [Article du blog de GitHub](https://github.com/blog/120-new-to-git)

source: Getting the latest code from the FreshRSS repository
fr: Obtenir le dernier code du répertoire FreshRSS

source: First you need to add the official repo to your remote repo list:
fr: Vous devez avant tout ajouter le repo officiel à votre liste de repo remote :

source: You can verify the remote repo is successfully added by using:
fr: Vous pouvez vérifier que le repo remote a été ajouté avec succès en utilisant :

source: Now you can pull the latest development code:
fr: Vous pouvez maintenant pull le dernier code de développement :

source: Starting a new development branch
fr: Lancer une nouvelle branche de développement

source: git checkout -b my-development-branch
fr: git checkout -b mon-branch-developpement

source: Sending a patch
fr: Proposer un patch

source: # Add the changed file, here actualize_script.php git add app/actualize_script.php # Commit the change and write a proper commit message git commit # Double check all looks well git show # Push it to your fork git push
fr: # Ajoutez le fichier modifié, ici actualize_script.php git add app/actualize_script.php # Commitez le changement et écrivez un message de commit approprié. git commit # Vérifiez deux fois que tout a l'air d'aller bien git show # Poussez les changements sur ton fork git push

source: Now you can create a PR based on your branch.
fr: Vous pouvez maintenant créer une PR en fonction de votre branche.

source: How to write a commit message
fr: Comment écrire un message de commit

source: A commit message should succintly describe the changes on the first line. For example:
fr: Un message de commit devrait décrire succinctement les changements sur la première ligne. Par exemple :

source: > Fix broken icon
fr: > Fixe une icône cassée

source: If necessary, this can be followed by a blank line and a longer explanation.
fr: Si nécessaire, une ligne blanche et une explication plus longue peuvent le suivre.

source: For further tips, see [here](https://chris.beams.io/posts/git-commit/).
fr: Pour d'autres conseils, voir [ici](https://chris.beams.io/posts/git-commit/).

source: Models
fr: Modèles

source: Controllers and actions
fr: Contrôleurs et actions

source: Views
fr: Vues

source: Routing
fr: Routage

source: Writing URL
fr: Écriture des URL

source: Understanding internals
fr: Comprendres les mécanismes internes

source: Accessing the database
fr: Accès à la base de données

source: Writing an action and its related view
fr: Écrire une action et sa vue associée

source: Authentication
fr: Gestion de l'authentification

source: Logs
fr: Gestion des logs

source: Writing extensions for FreshRSS
fr: Écriture d'extensions pour FreshRSS

source: About FreshRSS
fr: Présentation de FreshRSS

source: FreshRSS is an RSS / Atom feed aggregator written in PHP dating back to October 2012. The official site is located at [freshrss.org](https://freshrss.org) and the official repository is hosted on Github: [github.com/FreshRSS/FreshRSS](https://github.com/FreshRSS/FreshRSS).
fr: FreshRSS est un agrégateur de flux RSS / Atom écrit en PHP depuis octobre 2012. Le site officiel est situé à l'adresse [freshrss.org](https://freshrss.org) et son dépot Git est hébergé par Github : [github.com/FreshRSS/FreshRSS](https://github.com/FreshRSS/FreshRSS).

source: The problem
fr: Problème à résoudre

source: FreshRSS is limited in its technical possibilities by various factors:
fr: FreshRSS est limité dans ses possibilités techniques par différents facteurs :

source: The number of developers
fr: La disponibilité des développeurs principaux ;

source: The will to integrate certain changes
fr: La volonté d'intégrer certains changements ;

source: The level of "hacking" required to integrate marginal features
fr: Le niveau de « hack » nécessaire pour intégrer des fonctionnalités à la marge.

source: While the first limitation can, in theory, be lifted by the participation of new contributors to the project, it depends on the willingness of contributors to take an interest in the source code of the entire project. In order to remove the other two limitations, most of the time it will be necessary to create a "fork".
fr: Si la première limitation peut, en théorie, être levée par la participation de nouveaux contributeurs au projet, elle est en réalité conditionnée par la volonté des contributeurs à s'intéresser au code source du projet en entier. Afin de lever les deux autres limitations quant à elles, il faudra la plupart du temps passer par un « à-coté » souvent synonyme de « fork ».

source: Another solution consists of an extension system. By allowing users to write their own extension without taking an interest in the core of the basic software, we allow for:
fr: Une autre solution consiste à passer par un système d'extensions. En permettant à des utilisateurs d'écrire leur propre extension sans avoir à s'intéresser au cœur même du logiciel de base, on permet :

source: Reducing the amount of source code a new contributor has to take in
fr: De réduire la quantité de code source à assimiler pour un nouveau contributeur ;

source: Unofficial integration of novelties
fr: De permettre d'intégrer des nouveautés de façon non-officielles ;

source: No forking or main developer approval required.
fr: De se passer des développeurs principaux pour d'éventuelles améliorations sans passer par la case « fork ».

source: Note: it is quite conceivable that the functionalities of an extension can later be officially integrated into the FreshRSS code. Extensions make it easy to propose a proof of concept.
fr: Note : il est tout à fait imaginable que les fonctionnalités d'une extension puissent par la suite être intégrées dans le code initial de FreshRSS de façon officielle. Cela permet de proposer un « proof of concept » assez facilement.

source: Understanding basic mechanics (Minz and MVC)
fr: Comprendre les mécaniques de base (Minz et MVC)

source: **TODO** : move to 02_Minz.md
fr: **TODO** : bouger dans 02_Minz.md

source: This data sheet should refer to the official FreshRSS and Minz documentation (the PHP framework on which FreshRSS is based). Unfortunately, this documentation does not yet exist. In a few words, here are the main things you should know. It is not necessary to read all the chapters in this section if you don't need to use a feature in your extension (if you don't need to translate your extension, no need to know more about the `Minz_Translate` module for example).
fr: Cette fiche technique devrait renvoyer vers la documentation officielle de FreshRSS et de Minz (le framework PHP sur lequel repose FreshRSS). Malheureusement cette documentation n'existe pas encore. Voici donc en quelques mots les principaux éléments à connaître. Il n'est pas nécessaire de lire l'ensemble des chapitres de cette section si vous n'avez pas à utiliser une fonctionnalité dans votre extension (si vous n'avez pas besoin de traduire votre extension, pas besoin d'en savoir plus sur le module `Minz_Translate` par exemple).

source: MVC Architecture
fr: Architecture MVC

source: Minz relies on and imposes an MVC architecture on projects using it. This architecture consists of three main components:
fr: Minz repose et impose une architecture MVC pour les projets l'utilisant. On distingue dans cette architecture trois composants principaux :

source: The model: this is the base object that we will manipulate. In FreshRSS, categories, flows and articles are templates. The part of the code that makes it possible to manipulate them in a database is also part of the model but is separated from the base model: we speak of DAO (for "Data Access Object"). The templates are stored in a `Models` folder.
fr: Le Modèle : c'est l'objet de base que l'on va manipuler. Dans FreshRSS, les catégories, les flux et les articles sont des modèles. La partie du code qui permet de les manipuler en base de données fait aussi partie du modèle mais est séparée du modèle de base : on parle de DAO (pour « Data Access Object »). Les modèles sont stockés dans un répertoire `Models`.

source: The view: this is what the user sees. The view is therefore simply HTML code mixed with PHP to display dynamic information. The views are stored in a `views` folder.
fr: La Vue : c'est ce qui représente ce que verra l'utilisateur. La vue est donc simplement du code HTML que l'on mixe avec du PHP pour afficher les informations dynamiques. Les vues sont stockées dans un répertoire `views`.

source: The controller: this is what makes it possible to link models and views. Typically, a controller will load templates from the database (like a list of items) to "pass" them to a view for display. Controllers are stored in a `Controllers` directory.
fr: Le Contrôleur : c'est ce qui permet de lier modèles et vues entre eux. Typiquement, un contrôleur va charger des modèles à partir de la base de données (une liste d'articles par exemple) pour les « passer » à une vue afin qu'elle les affiche. Les contrôleurs sont stockés dans un répertoire `Controllers`.

source: In order to link a URL to a controller, first you have to go through a "routing" phase. In FreshRSS, this is particularly simple because it suffices to specify the name of the controller to load into the URL using a `c` parameter. For example, the address http://exemple.com?c=hello will execute the code contained in the `hello` controller.
fr: Afin de lier une URL à un contrôleur, on doit passer par une phase dite de « routage ». Dans FreshRSS, cela est particulièrement simple car il suffit d'indiquer le nom du contrôleur à charger dans l'URL à l'aide d'un paramètre `c`. Par exemple, l'adresse http://exemple.com?c=hello va exécuter le code contenu dans le contrôleur `hello`.

source: One concept that has not yet been discussed is the "actions" system. An action is executed *on* a controller. Concretely, a controller is represented by a class and its actions by methods. To execute an action, it is necessary to specify an `a` parameter in the URL.
fr: Une notion qui n'a pas encore été évoquée est le système d'« actions ». Une action est exécutée *sur* un contrôleur. Concrètement, un contrôleur va être représenté par une classe et ses actions par des méthodes. Pour exécuter une action, il est nécessaire d'indiquer un paramètre `a` dans l'URL.

source: Code example:
fr: Exemple de code :

source: When loading the address http://exemple.com?c=hello&a=world, the `world` action is executed on the `hello` controller.
fr: Si l'on charge l'adresse http://exemple.com?c=hello&a=world, l'action `world` va donc être exécutée sur le contrôleur `hello`.

source: Note: if `c` or `a` is not specified, the default value for each of these variables is `index`. So the address http://exemple.com?c=hello will execute the `index` action of the `hello` controller.
fr: Note : si `c` ou `a` n'est pas précisée, la valeur par défaut de chacune de ces variables est `index`. Ainsi l'adresse http://exemple.com?c=hello va exécuter l'action `index` du contrôleur `hello`.

source: From now on, the `hello/world` naming convention will be used to refer to a controller/action pair.
fr: Plus loin, sera utilisée la convention `hello/world` pour évoquer un couple contrôleur/action.

source: Each view is associated with a controller and an action. The view associated with `hello/world` will be stored in a very specific file: `views/hello/world. phtml`. This convention is imposed by Minz.
fr: Chaque vue est associée à un contrôleur et à une action. La vue associée à `hello/world` va être stockée dans un fichier bien spécifique : `views/hello/world.phtml`. Cette convention est imposée par Minz.

source: As explained above, the views consist of HTML mixed with PHP. Code example:
fr: Comme expliqué plus haut, les vues sont du code HTML mixé à du PHP. Exemple de code :

source: <p> This is a parameter passed from the controller: <?= $this->a_variable ?> </p>
fr: <p> Phrase passée en paramètre : <?= $this->a_variable ?> </p>

source: The variable `$this->a_variable` is passed by the controller (see previous example). The difference is that in the controller it is necessary to pass `$this->view`, while in the view `$this` suffices.
fr: La variable `$this->a_variable` a été passée précédemment par le contrôleur (voir exemple précédent). La différence est que dans le contrôleur il est nécessaire de passer par `$this->view` et que dans la vue `$this` suffit.

source: Working with GET / POST
fr: Accéder aux paramètres GET / POST

source: It is often necessary to take advantage of parameters passed by GET or POST. In Minz, these parameters are accessible using the `Minz_Request` class. Code example:
fr: Il est souvent nécessaire de profiter des paramètres passés par GET ou par POST. Dans Minz, ces paramètres sont accessibles de façon indistincts à l'aide de la classe `Minz_Request`. Exemple de code :

source: <?php $default_value = 'foo'; $param = Minz_Request::param('bar', $default_value); // Display the value of the parameter `bar` (passed via GET or POST) // or "foo" if the parameter does not exist. echo $param; // Sets the value of the `bar` parameter Minz_Request::_param('bar', 'baz'); // Will necessarily display "baz" since we have just forced its value. // Note that the second parameter (default) is optional. echo Minz_Request::param('bar'); ?>
fr: <?php $default_value = 'foo'; $param = Minz_Request::param('bar', $default_value); // Affichera la valeur du paramètre `bar` (passé via GET ou POST) // ou "foo" si le paramètre n'existe pas. echo $param; // Force la valeur du paramètre `bar` Minz_Request::_param('bar', 'baz'); // Affichera forcément "baz" puisque nous venons de forcer sa valeur. // Notez que le second paramètre (valeur par défaut) est facultatif. echo Minz_Request::param('bar'); ?>

source: The `Minz_Request::isPost()` method can be used to execute a piece of code only if it is a POST request.
fr: La méthode `Minz_Request::isPost()` peut être utile pour n'exécuter un morceau de code que s'il s'agit d'une requête POST.

source: Note: it is preferable to use `Minz_Request` only in controllers. It is likely that you will encounter this method in FreshRSS views, or even in templates, but be aware that this is **not** good practice.
fr: Note : il est préférable de n'utiliser `Minz_Request` que dans les contrôleurs. Il est probable que vous rencontriez cette méthode dans les vues de FreshRSS, voire dans les modèles, mais sachez qu'il ne s'agit **pas** d'une bonne pratique.

source: Access session settings
fr: Accéder aux paramètres de session

source: The access to session parameters is strangely similar to the GET / POST parameters but passes through the `Minz_Session` class this time! There is no example here because you can repeat the previous example by changing all `Minz_Request` to `Minz_Session`.
fr: L'accès aux paramètres de session est étrangement similaire aux paramètres GET / POST mais passe par la classe `Minz_Session` cette fois-ci ! Il n'y a pas d'exemple ici car vous pouvez reprendre le précédent en changeant tous les `Minz_Request` par des `Minz_Session`.

source: Working with URLs
fr: Gestion des URL

source: To take full advantage of the Minz routing system, it is strongly discouraged to write hard URLs in your code. For example, the following view should be avoided:
fr: Pour profiter pleinement du système de routage de Minz, il est fortement déconseillé d'écrire les URL en dur dans votre code. Par exemple, la vue suivante doit être évitée :

source: <p> Go to page <a href="http://example.com?c=hello&amp;a=world">Hello world</a>! </p>
fr: <p> Accéder à la page <a href="http://exemple.com?c=hello&amp;a=world">Hello world</a>! </p>

source: If one day it was decided to use a "url rewriting" system to have addresses in a http://exemple.com/controller/action format, all previous addresses would become ineffective!
fr: Si un jour il est décidé d'utiliser un système d'« url rewriting » pour avoir des adresses au format http://exemple.com/controller/action, toutes les adresses précédentes deviendraient ineffectives !

source: So use the `Minz_Url` class and its `display()` method instead. `Minz_Url::display()` takes an array of the following form as its argument:
fr: Préférez donc l'utilisation de la classe `Minz_Url` et de sa méthode `display()`. `Minz_Url::display()` prend en paramètre un tableau de la forme suivante :
