Repository: FreshRSS/FreshRSS
Catalog: docs/i18n/freshrss.*.po
Languages: fr

source: When everything's working, it's time to announce the release to the world!
fr: Lorsque tout fonctionne, il est temps d'annoncer la sortie au monde entier !

source: on GitHub by creating[a new release](https://github.com/FreshRSS/FreshRSS/releases/new)
fr: sur GitHub en créant [une nouvelle release](https://github.com/FreshRSS/FreshRSS/releases/new) ;

source: on the freshrss.org blog, at least for stable versions (write the article on[FreshRSS/freshrss.org](https://github.com/FreshRSS/freshrss.org))
fr: sur le blog de freshrss.org au minimum pour les versions stables (écrire l'article sur [FreshRSS/freshrss.org](https://github.com/FreshRSS/freshrss.org)).

source: on Twitter ([@FreshRSS](https://twitter.com/FreshRSS) account)
fr: sur Twitter (compte [@FreshRSS](https://twitter.com/FreshRSS)) ;

source: and on mailing@freshrss.org
fr: et sur mailing@freshrss.org ;

source: Starting the next development version
fr: Lancer la prochaine version de développement

source: $ git checkout master $ vim constants.php # Update the FRESHRSS_VERSION $ vim CHANGELOG.md # Prepare the changelog for the next version $ git add CHANGELOG.md && git commit && git push
fr: $ git checkout master $ vim constants.php # Mettre à jour le numéro de version de FRESHRSS_VERSION $ vim CHANGELOG.md # Préparer la section pour la prochaine version $ git add CHANGELOG.md && git commit && git push

source: Also remember to update update.freshrss.org so that it takes the current development version into account.
fr: Pensez aussi à mettre à jour update.freshrss.org pour qu'il prenne en compte la version de développement actuelle.

source: ![FreshRSS logo](img/logo_freshrss.png)
fr: ![Logo de FreshRSS](img/logo_freshrss.png)

source: FreshRSS is an RSS aggregator and reader. It allows you to read and follow several news websites at a glance without the need to browse from one website to another.
fr: FreshRSS est un agrégateur et lecteur de flux RSS. Il permet de regrouper l’actualité de plusieurs sites différents dans un endroit unique pour que vous puissiez la lire sans devoir aller de site en site.

source: FreshRSS has a lot of features including:
fr: FreshRSS a été conçu comme un agrégateur puissant et propose des tas de fonctionnalités :

source: RSS and Atom aggregation
fr: Agrégation des flux RSS et Atom.

source: Mark article as favorite if you liked it or if you want to read it later
fr: Utilisez les favoris pour marquer les articles qui vous ont plu ou que vous souhaitez lire plus tard.

source: Filter and search functionality helps to easily find articles
fr: Le système de filtrage et de recherche permettent de cibler exactement les articles que vous souhaitez lire.

source: Statistics to show you the publishing frequency all the websites you follow
fr: Les statistiques permettent de savoir en un coup d’œil quels sont les sites qui publient le plus, ou à l’inverse, le moins.

source: Import/export of your feeds into OPML format
fr: Importation / exportation des flux au format OPML.

source: Several themes created by the community
fr: Multi-thèmes pour changer l’habillage de FreshRSS.

source: "Google Reader"-like API to connect Android applications
fr: API Google Reader pour pouvoir y brancher des applications Android.

source: The application is "responsive," which means it adapts to small screens so you can bring articles in your pocket
fr: « *Responsive design* » : l’application s’adapte aux petits écrans pour emporter FreshRSS dans votre poche.

source: Self-hosted: the code is free (under AGPL3 licence), so you can host your own instance of FreshRSS
fr: Auto-hébergeable : le code source est libre (AGPL3) et vous pouvez donc l’héberger sur votre propre serveur.

source: Multi-user, so you can also host for your friends and family
fr: Multi-utilisateurs pour héberger plusieurs personnes sur une même installation.

source: And a lot more!
fr: Et bien d’autres !

source: This documentation is split into different sections:
fr: Cette documentation est divisée en plusieurs parties :

source: [User documentation](./users/02_First_steps.html), where you can discover all the possibilities offered by FreshRSS
fr: La [documentation utilisateurs](./users/02_First_steps.md) pour découvrir les fonctionnalités de FreshRSS.

source: [Administrator documentation](./admins/01_Index.html) for detailed installation and maintenance related tasks
fr: La [documentation administrateurs](../en/admins/01_Installation.md) (en anglais) pour l’installation et la maintenance de FreshRSS.

source: [Developer documentation](./developers/01_First_steps.html) to guide you in the source code of FreshRSS and to help you if you want to contribute
fr: La [documentation développeurs](./developers/01_First_steps.md) pour savoir comment contribuer et mieux comprendre le code source de FreshRSS.

source: [Contributor guidelines](./contributing.md) for those who want to help improve FreshRSS
fr: Le [guide de contribution](./contributing.md) pour nous aider à développer FreshRSS.

source: Learning how to handle a new application is not always easy. We've tried to make FreshRSS as intuitive as possible, but you might still need a little help to master the program.
fr: Découvrir un nouveau logiciel n'est pas toujours facile. Si nous avons voulu FreshRSS le plus intuitif possible, vous aurez peut-être besoin d'un coup de main pour le maîtriser.

source: This section will guide you to the pages you need to get started. The order is tailored to newcomers.
fr: Cette section se propose de vous aider dans la prise en main de l'outil. Il ne s'agit que de liens menant vers les autres pages de la documentation mais ordonnées dans un ordre spécifique aux nouveaux arrivants.

source: [After installing the application](../admins/03_Installation.md), the first step is to add some feeds. You have a few options:
fr: [Après l'installation](../../en/admins/03_Installation.md), la première chose à faire est d'ajouter un ou plusieurs sites à suivre. Pour cela plusieurs choix s'offrent à vous :

source: [Add a feed manually](04_Subscriptions.md#adding-a-feed)
fr: [Ajouter un flux manuellement](04_Subscriptions.md#ajouter-un-flux)

source: [Import an OPML or JSON file](04_Subscriptions.md#import-and-export)
fr: [Importer un fichier OPML ou JSON](04_Subscriptions.md#import-et-export)

source: [Use the bookmarklet](04_Subscriptions.md#use-bookmarklet)
fr: [Utiliser le bookmark dédié](04_Subscriptions.md#utiliser-le-bookmark)

source: Once you have added your feeds to FreshRSS, it is time to read them. There are three availalbe reading modes:
fr: Une fois que vous avez ajouté vos flux à FreshRSS, il est temps de les lire. Pour cela, trois modes de lecture s'offrent à vous :

source: [The normal view](03_Main_view.md#normal-view) enables you to quickly read new articles
fr: [La vue normale](03_Main_view.md#la-vue-normale) qui permet de voir et de lire rapidement les nouveaux articles

source: [The global view](03_Main_view.md#global-view) shows you an overview of the status of your feeds in one glance
fr: [La vue globale](03_Main_view.md#la-vue-globale) est destinée à vous offrir un panorama de l'état de vos flux

source: [The reader view](03_Main_view.md#reader-view) offers you a comfortable reading experience
fr: [La vue lecture](03_Main_view.md#la-vue-lecture) est pensée pour vous offrir un meilleur confort de lecture

source: Now that you've mastered basic use, it's time to configure FreshRSS to improve your reading experience. It's highly configurable, so it's recommended to play around with them to find a configuration that suits you well. Here are a few resources to help you improve your daily FreshRSS experience:
fr: Bien, vous maitrisez maintenant la vue que vous préférez ? Il est temps de vous offrir un peu plus de confort de lecture. FreshRSS est grandement configurable et c'est à vous de trouver la configuration qui vous conviendra le plus. Voici tout de même quelques pistes pour améliorer votre quotidien sur FreshRSS :

source: [Organize your feeds in categories](04_Subscriptions.md#feed-management)
fr: [Rangez vos flux dans des catégories](04_Subscriptions.md#organisation_des_flux)

source: [Change the home page](05_Configuration.md#changing-the-view)
fr: [Configurez votre page d'accueil](05_Configuration.md#personnaliser-la-vue)

source: [Choose the reading options](05_Configuration.md#reading-options)
fr: [Configurez vos options de lecture](05_Configuration.md#options-de-lecture)

source: [Refresh feeds](03_Main_view.md#refreshing-feeds)
fr: [Mettez à jour vos flux](03_Main_view.md#rafraichir-les-flux)

source: [Filter articles](03_Main_view.md#filtering-articles) for a fast access to a selection
fr: [Filtrez les articles](03_Main_view.md#filtrer-les-articles) pour accéder rapidement à ceux que vous voulez lire en priorité

source: [Search an article](03_Main_view.md#searching-articles) published some time ago
fr: [Retrouvez un article](03_Main_view.md#rechercher-des-articles) qui a été publié il y a quelques jours ou mois

source: [Access your feeds on a mobile device](06_Mobile_access.md)
fr: [Accédez à vos flux même sur mobile](06_Mobile_access.md)

source: [Add some extensions](https://github.com/FreshRSS/Extensions)
fr: [Ajoutez quelques extensions](https://github.com/FreshRSS/Extensions)

source: [Frequently asked questions](07_Frequently_Asked_Questions.md)
fr: [Foire aux questions](07_Frequently_Asked_Questions.md)

source: Normal view
fr: La vue normale

source: Global view
fr: La vue globale

source: Reader view
fr: La vue lecture

source: Refreshing feeds
fr: Rafraîchir les flux

source: To take full advantage of FreshRSS, it needs to retrieve new items from the feeds you have subscribed to. There are several ways to do this.
fr: Pour profiter pleinement de FreshRSS, il faut qu’il récupère les nouveaux articles disponibles des flux auxquels vous avez souscrit. Pour cela, il existe plusieurs méthodes.

source: Automatic update
fr: Mise à jour automatique

source: This is the recommended method since you can forget about it once it is configured.
fr: C’est la méthode recommandée car il n’y a pas besoin d’y penser, elle se fait toute seule, à la fréquence que vous avez choisi.

source: With the actualize_script.php script
fr: Par le script actualize_script.php

source: This method is only available if you have access to the scheduled tasks of the machine on which your FreshRSS instance is installed.
fr: Cette méthode n’est possible que si vous avez accès aux tâches planifiées de la machine sur laquelle est installée votre instance de FreshRSS.

source: The script is named *actualize_script.php* and is located in the *app* folder. The scheduled task syntax will not be explained here. However, here is [a quick introduction to crontab](http://www.adminschoice.com/crontab-quick-reference/) that might help you.
fr: Le script qui permet de mettre à jour les articles s’appelle *actualize_script.php* et se trouve dans le répertoire *app* de votre instance de FreshRSS. La syntaxe des tâches planifiées ne sera pas expliqué ici, cependant voici [une introduction rapide à crontab](http://www.adminschoice.com/crontab-quick-reference/) qui peut vous aider.

source: Here is an example to trigger article update every hour.
fr: Ci-dessous vous trouverez un exemple permettant la mise à jour des articles toutes les heures.

source: 0 * * * * php /path/to/FreshRSS/app/actualize_script.php > /tmp/FreshRSS.log 2>&1
fr: 0 * * * * php /chemin/vers/FreshRSS/app/actualize_script.php > /tmp/FreshRSS.log 2>&1

source: Special parameters to configure the script - all parameters can be combined:
fr: « Paramètres de configuration du script; Ils sont utilisables simultanément : »

source: No authentication
fr: Aucune authentification

source: This is the most straightforward since you have a public instance; there is nothing special to configure:
fr: C’est le cas le plus simple, puisque votre instance est publique, vous n’avez rien de particulier à préciser :

source: Form authentication
fr: Authentification par formulaire

source: If you configure the application to allow anonymous reading, you can also allow anonymous users to update feeds (“Allow anonymous refresh of the articles”).
fr: Dans ces cas-là, si vous avez autorisé la lecture anonyme des articles, vous pouvez aussi permettre à n’importe qui de rafraîchir vos flux (« Autoriser le rafraîchissement anonyme des flux »).

source: ![Anonymous access configuration](../img/users/anonymous_access.1.png)
fr: ![Configuration de l’accès anonymes](../img/users/anonymous_access.1.png)

source: The URL used in the previous section will now become accessible to anyone. Therefore you can use the same syntax for the scheduled task.
fr: L’url précédente devient donc accessible à n’importe qui et vous pouvez utiliser la tâche cron de la partie précédente.

source: You can also configure an authentication token to grant special access on the server.
fr: Vous pouvez aussi configurer un jeton d’authentification pour accorder un droit spécial sur votre serveur.

source: ![Token configuration](../img/users/token.1.png)
fr: ![Configuration du token](../img/users/token.1.png)

source: The scheduled task syntax should look as follows:
fr: La tâche cron à utiliser sera de la forme suivante :

source: 0 * * * * curl 'https://freshrss.example.net/i/?c=feed&a=actualize&token=my-token'
fr: 0 * * * * curl 'https://freshrss.example.net/i/?c=feed&a=actualize&token=mon-token'

source: 0 * * * * curl 'https://freshrss.example.net/i/?c=feed&a=actualize&user=someone&token=my-token'
fr: 0 * * * * curl 'https://freshrss.exemple.net/i/?c=feed&a=actualize&user=quelquun&token=mon-token'

source: HTTP authentication
fr: Authentification HTTP

source: When using HTTP authentication, the syntax in the two previous sections is unusable. You'll need to provide your credentials to the scheduled task. **Note that this method is highly discouraged since it means that your credentials will be in plain sight!**
fr: Dans ce cas-là, le token et les permissions “anonymes” sont inutilisables et il vous sera nécessaire d’indiquer vos identifiants dans la tâche cron. **Notez que cette solution est grandement déconseillée puisqu’elle implique que vos identifiants seront visibles en clair !**

source: 0 * * * * curl -u alice:password123 'https://freshrss.example.net/i/?c=feed&a=actualize'
fr: 0 * * * * curl -u alice:motdepasse123 'https://freshrss.exemple.net/i/?c=feed&a=actualize'

source: Manual update
fr: Mise à jour manuelle

source: If you can't or don't want to use the automatic method, you can update manually. There are two methods for updating all or some of the feeds.
fr: Si vous ne pouvez pas ou ne voulez pas utiliser la méthode automatique, vous pouvez le faire de façon manuelle. Il existe deux méthodes qui permettent de mettre à jour tout ou partie des flux.

source: Complete update
fr: Mise à jour complète

source: This update occurs on all feeds. To trigger it, simply click on the update link in the navigation menu.
fr: Cette mise à jour se fait pour l’ensemble des flux de l’instance. Pour initier cette mise à jour, il suffit de cliquer sur le lien de mise à jour disponible dans le menu de navigation.

source: ![Navigation menu](../img/users/refresh.1.png)
fr: ![Menu de navigation](../img/users/refresh.1.png)

source: When the update starts, a progress bar appears and changes while feeds are processed.
fr: Lorsque la mise à jour démarre, une barre de progression apparait et s’actualise au fur et à mesure de la récupération des articles.

source: ![Progress bar](../img/users/refresh.5.png)
fr: ![Barre de progression](../img/users/refresh.5.png)

source: Partial update
fr: Mise à jour partielle

source: This update occurs on the selected feed only. To trigger it, simply click on the update link in the feed menu.
fr: Cette mise à jour se fait pour le flux sélectionné uniquement. Pour initier cette mise à jour, il suffit de cliquer sur le lien de mise à jour disponible dans le menu du flux.

source: ![Feed menu](../img/users/refresh.2.png)
fr: ![Menu du flux](../img/users/refresh.2.png)

source: Filtering articles
fr: Filtrer les articles

source: When the number of articles stored by FreshRSS inevitably grows larger, it's important to use efficient filters to display only a subset of the articles. There are several methods that filter with different criteria. Usually those methods can be combined.
fr: Avec le nombre croissant d’articles stockés par FreshRSS, il devient important d’avoir des filtres efficaces pour n’afficher qu’une partie des articles. Il existe plusieurs méthodes qui filtrent selon des critères différents. Ces méthodes peuvent être combinées dans la plus part des cas.

source: By category
fr: Par catégorie

source: This is the easiest method. You only need to click on the category title in the side panel. There are two special categories at the top of the panel:
fr: C’est la méthode la plus simple. Il suffit de cliquer sur le titre d’une catégorie dans le panneau latéral. Il existe deux catégories spéciales qui sont placées en haut dudit panneau :

source: *Main feed* displays only articles from feeds marked as available in that category
fr: *Flux principal* qui affiche uniquement les articles des flux marqués comme visible dans cette catégorie

source: *Favourites* displays only articles marked as favourites
fr: *Favoris* qui affiche uniquement les articles, tous flux confondus, marqués comme favoris

source: By feed
fr: Par flux

source: There are several methods to filter articles by feed:
fr: Il existe plusieurs méthodes pour filtrer les articles par flux :

source: by clicking the feed title in the side panel
fr: en cliquant sur le titre du flux dans le panneau latéral

source: by clicking the feed title in the article details
fr: en cliquant sur le titre du flux dans le détail de l’article

source: by filtering in the feed options from the side panel
fr: en filtrant dans les options du flux dans le panneau latéral

source: by filtering in the feed configuration
fr: en filtrant dans la configuration du flux

source: ![Feed filter](../img/users/feed.filter.1.png)
fr: ![Filtrer par flux](../img/users/feed.filter.1.png)

source: By status
fr: Par statut

source: Each article has two attributes that can be combined. The first attribute indicates whether or not the article has been read. The second attribute indicates if the article was marked as favorite or not.
fr: Chaque article possède deux attributs qui peuvent être combinés. Le premier attribut indique si l’article a été lu ou non. Le second attribut indique si l’article a été noté comme favori ou non.

source: In version 0.7, attribute filters are available in the article display dropdown list. With this version, it's not possible to combine filters. For instance, it's not possible to display only read and favorite articles.
fr: Dans la version 0.7.x, les filtres sur les attributs sont accessibles depuis la liste déroulante qui gère l’affichage des articles. Dans cette version, il n’est pas possible de combiner les filtres. Par exemple, on ne peut pas afficher les articles lus qui ont été notés comme favori.

source: ![Attribute filters in 0.7](../img/users/status.filter.0.7.png)
fr: ![Filtrer par attribut en version 0.7](../img/users/status.filter.0.7.png)

source: With the search field
fr: Grâce au champ de recherche

source: You can use the search field to further refine results:
fr: Il est possible d’utiliser le champ de recherche pour raffiner les résultats :

source: by author: `author:name` or `author:'composed name'`
fr: par auteur : `author:nom` or `author:'nom composé'`

source: by title: `intitle:keyword` or `intitle:'composed keyword'`
fr: par titre : `intitle:mot` or `intitle:'mot composé'`

source: by URL: `inurl:keyword` or `inurl:'composed keyword'`
fr: par URL: `inurl:mot` or `inurl:'mot composé'`

source: by tag: `#tag`
fr: par tag: `#tag`

source: by free-text: `keyword` or `'composed keyword'`
fr: par texte libre : `mot` or `'mot composé'`

source: Be careful not to enter a space between the operator and the search value.
fr: Attention à ne pas introduire d’espace entre l’opérateur et la valeur recherchée.

source: Some operators can be used negatively, to exclude articles, with the same syntax as above, but prefixed by a `!` or `-`: `-author:name`, `-intitle:keyword`, `-inurl:keyword`, `-#tag`, `!keyword`.
fr: Certains opérateurs peuvent être utilisé négativement, pour exclure des articles, avec la même syntaxe que ci-dessus, mais préfixé par `!` ou `-` :`-author:nom`, `-intitle:mot`, `-inurl:mot`, `-#tag`, `!mot`.

source: It is also possible to combine keywords to create a more precise filter. For example, you can enter multiple instances of `author:`, `intitle:`, `inurl:`, `#`, and free-text.
fr: Il est également possible de combiner les mots-clefs pour faire un filtrage encore plus précis, et il est autorisé d’avoir plusieurs instances de : `author:`, `intitle:`, `inurl:`, `#`, et texte libre.

source: Combining several search criteria implies a logical *and*, but the keyword ` OR ` can be used to combine several search criteria with a logical *or* instead: `author:Dupont OR author:Dupond`
fr: Combiner plusieurs critères implique un *et* logique, mais le mot clef ` OR ` peut être utiliser pour combiner plusieurs critères avec un *ou* logique :`author:Dupont OR author:Dupond`

source: Adding a feed
fr: Ajouter un flux

source: Import and export
fr: Import et export

source: Use bookmarklet
fr: Utiliser le « bookmarklet »

source: Bookmarklets are little scripts that you can execute to perform various tasks. FreshRSS offers a bookmarklet for subscribing to newsfeeds.
fr: Les « bookmarklets » sont de petits scripts que vous pouvez exécuter pour effectuer des tâches diverses et variées. FreshRSS offre un signet ( « bookmark » ) pour s'abonner aux fils de nouvelles.

source: Open "Subscriptions management".
fr: Ouvrez "Gestion des abonnements".

source: Click on "Subscription tools".
fr: Cliquez sur "Outils d'abonnement".

source: Drag the "Subscribe" button to your bookmark toolbar or right click and choose your browser's "Bookmark link" action.
fr: Glissez le bouton "S'abonner" dans la barre d'outils des signets ou cliquez droit et choisissez l'action "Lien vers les signets" de votre navigateur.

source: Feed management
fr: Organisation des flux

source: Display
fr: Personnaliser la vue

source: Language
fr: Langue

source: FreshRSS is currently available in 14 languages. After confirming your choice, the interface will be displayed in your preferred language. Depending on the language chosen, parts of the interface may not be not translated yet. If you're willing to help translate the missing bits or would like to add a new language, please take a look at how you can [contribute to the project](../contributing.md#contribute-to-internationalization-i18n).
fr: À l'heure actuelle, FreshRSS est disponible en 13 langues. Après validation de ce choix, l'interface sera affichée dans la langue choisie, même si certaines parties de l'interface peuvent ne pas encore avoir été traduites. Si vous voulez aider à la traduction, regardez comment vous pouvez [contribuer au projet](../contributing.md#contribute-to-internationalization-i18n).

source: Some parts of FreshRSS aren't translated and aren't intended to be translated either. For now, this includes the logs visible in the application as well as the log generated by automatic update scripts.
fr: Il y a des parties de FreshRSS qui ne sont pas traduites et qui n'ont pas vocation à l'être. Pour le moment, les logs visibles dans l'application ainsi que celle générées par le script de mise à jour automatique en font partie.
