Repository: FreshRSS/FreshRSS
Catalog: docs/i18n/freshrss.*.po
Languages: fr

source: 7. Pick a client supporting a Google Reader-like API. Selection: * Android * [News+](https://play.google.com/store/apps/details?id=com.noinnion.android.newsplus) with [News+ Google Reader extension](https://play.google.com/store/apps/details?id=com.noinnion.android.newsplus.extension.google_reader) (Closed source) * [FeedMe 3.5.3+](https://play.google.com/store/apps/details?id=com.seazon.feedme) (Closed source) * [EasyRSS](https://github.com/Alkarex/EasyRSS) (Open source, [F-Droid](https://f-droid.org/packages/org.freshrss.easyrss/)) * Linux * [FeedReader 2.0+](https://jangernert.github.io/FeedReader/) (Open source) * MacOS * [Vienna RSS](http://www.vienna-rss.com/) (Open source) * [Reeder](https://www.reederapp.com/) (Commercial) * iOS * [Reeder](https://www.reederapp.com/) (Commercial) * Firefox * [FreshRSS-Notify](https://addons.mozilla.org/firefox/addon/freshrss-notify-webextension/) (Open source)
fr: 7. Vous pouvez maintenant tester sur une application mobile: * Android * [News+](https://play.google.com/store/apps/details?id=com.noinnion.android.newsplus) avec [News+ Google Reader extension](https://play.google.com/store/apps/details?id=com.noinnion.android.newsplus.extension.google_reader) (Closed source) * [FeedMe 3.5.3+](https://play.google.com/store/apps/details?id=com.seazon.feedme) (Propriétaire) * [EasyRSS](https://github.com/Alkarex/EasyRSS) (Libre, [F-Droid](https://f-droid.org/packages/org.freshrss.easyrss/)) * Linux * [FeedReader 2.0+](https://jangernert.github.io/FeedReader/) (Libre) * MacOS * [Vienna RSS](http://www.vienna-rss.com/) (Libre) * [Reeder](https://www.reederapp.com/) (Commercial) * iOS * [Reeder](https://www.reederapp.com/) (Commercial) * Firefox * [FreshRSS-Notify](https://addons.mozilla.org/firefox/addon/freshrss-notify-webextension/) (Libre)

source: Google Reader compatible API
fr: API compatible Google Reader

source: Examples of basic queries:
fr: Exemples de requêtes simples :

source: # Initial login, using API password (Email and Passwd can be given either as GET, or POST - better) curl 'https://freshrss.example.net/api/greader.php/accounts/ClientLogin?Email=alice&Passwd=Abcdef123456' SID=alice/8e6845e089457af25303abc6f53356eb60bdb5f8 Auth=alice/8e6845e089457af25303abc6f53356eb60bdb5f8 # Examples of read-only requests curl -s -H "Authorization:GoogleLogin auth=alice/8e6845e089457af25303abc6f53356eb60bdb5f8" \ 'https://freshrss.example.net/api/greader.php/reader/api/0/subscription/list?output=json' curl -s -H "Authorization:GoogleLogin auth=alice/8e6845e089457af25303abc6f53356eb60bdb5f8" \ 'https://freshrss.example.net/api/greader.php/reader/api/0/unread-count?output=json' curl -s -H "Authorization:GoogleLogin auth=alice/8e6845e089457af25303abc6f53356eb60bdb5f8" \ 'https://freshrss.example.net/api/greader.php/reader/api/0/tag/list?output=json' # Retrieve a token for requests making modifications curl -H "Authorization:GoogleLogin auth=alice/8e6845e089457af25303abc6f53356eb60bdb5f8" \ 'https://freshrss.example.net/api/greader.php/reader/api/0/token' 8e6845e089457af25303abc6f53356eb60bdb5f8ZZZZZZZZZZZZZZZZZ # Get articles, piped to jq for easier JSON reading curl -s -H "Authorization:GoogleLogin auth=alice/8e6845e089457af25303abc6f53356eb60bdb5f8" \ 'https://freshrss.example.net/api/greader.php/reader/api/0/stream/contents/reading-list' | jq .
fr: # Authentification utilisant le mot de passe API (Email et Passwd peuvent être passés en GET, ou POST - mieux) curl 'https://freshrss.example.net/api/greader.php/accounts/ClientLogin?Email=alice&Passwd=Abcdef123456' SID=alice/8e6845e089457af25303abc6f53356eb60bdb5f8 Auth=alice/8e6845e089457af25303abc6f53356eb60bdb5f8 # Exemples de requêtes en lecture curl -s -H "Authorization:GoogleLogin auth=alice/8e6845e089457af25303abc6f53356eb60bdb5f8" \ 'https://freshrss.example.net/api/greader.php/reader/api/0/subscription/list?output=json' curl -s -H "Authorization:GoogleLogin auth=alice/8e6845e089457af25303abc6f53356eb60bdb5f8" \ 'https://freshrss.example.net/api/greader.php/reader/api/0/unread-count?output=json' curl -s -H "Authorization:GoogleLogin auth=alice/8e6845e089457af25303abc6f53356eb60bdb5f8" \ 'https://freshrss.example.net/api/greader.php/reader/api/0/tag/list?output=json' # Demande de jeton pour faire de requêtes de modification curl -H "Authorization:GoogleLogin auth=alice/8e6845e089457af25303abc6f53356eb60bdb5f8" \ 'https://freshrss.example.net/api/greader.php/reader/api/0/token' 8e6845e089457af25303abc6f53356eb60bdb5f8ZZZZZZZZZZZZZZZZZ # Récupère les articles, envoyés à jq pour une lecture JSON plus facile curl -s -H "Authorization:GoogleLogin auth=alice/8e6845e089457af25303abc6f53356eb60bdb5f8" \ 'https://freshrss.example.net/api/greader.php/reader/api/0/stream/contents/reading-list' | jq .

source: We may not have answered all of your questions in the previous sections. The FAQ contains some questions that have not been answered elsewhere.
fr: Il est possible que nous n'ayons pas répondu à toutes vos questions dans les parties précédentes. La FAQ regroupe certaines interrogations qui n'ont pas trouvé leur réponse ailleurs.

source: What is `/i` at the end of the application URL?
fr: C'est quoi ce `/i` à la fin de l'URL ?

source: Of course, ```/i``` has a purpose! It's used for performance and usability:
fr: Bien entendu, le ```/i``` n'est pas là pour faire joli ! Il s'agit d'une question de performances et de praticité :

source: It allows for serving icons, images, styles and scripts without cookies. Without that trick, those files would be downloaded more often, especially when form authentication is used. Also, HTTP requests would be heavier.
fr: Cela permet de servir les icônes, images, styles, scripts sans cookie. Sans cela, ces fichiers seraient souvent re-téléchargés, en particulier lorsque le formulaire de connexion est utilisé. De plus, les requêtes vers ces ressources seraient plus lourdes.

source: The ```./p/``` public root can be served without any HTTP access restrictions. Whereas it could be implemented in ```./p/i/```.
fr: La racine publique ```./p/``` peut être servie sans restriction d'accès HTTP (qui peut avantageusement être mise en place dans ```./p/i/```).

source: It avoids problems while serving public resources like ```favicon.ico```, ```robots.txt```, etc.
fr: Cela permet d'éviter des problèmes pour des fichiers qui doivent être publics pour bien fonctionner, comme ```favicon.ico```, ```robots.txt```, etc.

source: It allows the logo to be displayed instead of a white page while hitting a restriction or a delay during the loading process.
fr: Cela permet aussi d'avoir un logo FreshRSS plutôt qu'une page blanche pour accueillir l'utilisateur par exemple dans le cas de la restriction d'accès HTTP ou lors de l'attente du chargement plus lourd du reste de l'interface.

source: Why is `robots.txt` located in a sub-folder?
fr: Pourquoi le ```robots.txt``` se trouve dans un sous-répertoire ?

source: To increase security, FreshRSS is hosted in two sections. The first section is public (the `./p` folder) and the second section is private (everything else). Therefore the `robots.txt` file is located in the `./p` sub-folder.
fr: Afin d'améliorer la sécurité, FreshRSS est découpé en deux parties : une partie publique (le répertoire ```./p```) et une partie privée (tout le reste !). Le ```robots.txt``` se trouve donc dans le sous-répertoire ```./p```.

source: As explained in the [security section](/en/User_documentation/Installation/Security), it's highly recommended to make only the public section available at the domain level. With that configuration, `./p` is the root folder for http://demo.freshrss.org/, thus making `robots.txt` available at the root of the application.
fr: Comme expliqué dans les [conseils de sécurité](01_Installation.md#conseils-de-securite), il est recommandé de faire pointer un nom de domaine vers ce sous-répertoire afin que seule la partie publique ne soit accessible par un navigateur web. De cette manière https://demo.freshrss.org/ pointe vers le répertoire ```./p``` et le ```robots.txt``` se trouve bien à la racine du site : https://demo.freshrss.org/robots.txt.

source: The same principle applies to `favicon.ico` and `.htaccess`.
fr: L'explication est la même pour les fichiers ```favicon.ico``` et ```.htaccess```.

source: Why do I have errors while registering a feed?
fr: Pourquoi j'ai des erreurs quand j'essaye d'enregistrer un flux ?

source: There can be different origins for that problem. The feed syntax can be invalid, it can be unrecognized by the SimplePie library, the hosting server can be the root of the problem, or FreshRSS can be buggy. The first step is to identify what causes the problem. Here are the steps to follow:
fr: Il peut y avoir différentes origines à ce problème. Le flux peut avoir une syntaxe invalide, il peut ne pas être reconnu par la bibliothèque SimplePie, l'hébergement peut avoir des problèmes, FreshRSS peut être boggué. Il faut dans un premier temps déterminer la cause du problème.Voici la liste des étapes à suivre pour la déterminer :

source: __Verify if the feed syntax is valid__ with the [W3C on-line tool](https://validator.w3.org/feed/ "RSS and Atom feed validator"). If it's not valid, there's nothing we can do.
fr: __Vérifier la validité du flux__ grâce à l'[outil en ligne du W3C](https://validator.w3.org/feed/ "Validateur en ligne de flux RSS et Atom"). Si ça ne fonctionne pas, nous ne pouvons rien faire.

source: __Verify SimplePie validation__ with the [SimplePie on-line tool](https://simplepie.org/demo/ "SimplePie official demo"). If it's not recognized, there's nothing we can do.
fr: __Vérifier la reconnaissance par SimplePie__ grâce à l'[outil en ligne de SimplePie](https://simplepie.org/demo/ "Démo officielle de SimplePie"). Si ça ne fonctionne pas, nous ne pouvons rien faire.

source: __Verify FreshRSS integration__ with the [demo](https://demo.freshrss.org "FreshRSS official demo"). If it's not working, you need to [create an issue on Github](https://github.com/FreshRSS/FreshRSS/issues/new "Create an issue for FreshRSS") so we can have a look at it. If it's working, there's probably something fishy with the hosting server.
fr: __Vérifier l'intégration dans FreshRSS__ grâce à la [démo](https://demo.freshrss.org "Démo officielle de FreshRSS"). Si ça ne fonctionne pas, il faut [créer un ticket sur Github](https://github.com/FreshRSS/FreshRSS/issues/new "Créer un ticket pour FreshRSS") pour que l'on puisse regarder ce qui se passe. Si ça fonctionne, il y a probablement un problème avec l'hébergement.

source: How can you change a forgotten password?
fr: Comment changer un mot de passe oublié ?

source: Since the [1.10.0](https://github.com/FreshRSS/FreshRSS/releases/tag/1.10.0) release, admins can change user passwords directly from the interface. This interface is available under ```Administration → Manage users```. Select a user, enter a password, and validate.
fr: Depuis la version [1.10.0](https://github.com/FreshRSS/FreshRSS/releases/tag/1.10.0), l'administrateur peut modifier le mot de passe d'un utilisateur depuis l'interface. Cette interface est disponible dans le menu ```Administration → Gestion des utilisateurs```. Il suffit de sélectionner l'utilisateur, de saisir un mot de passe et de valider.

source: Since the [1.8.0](https://github.com/FreshRSS/FreshRSS/releases/tag/1.8.0) release, admins can change user passwords using a terminal. It worth mentioning that you must have access to PHP CLI. Open a terminal, and type the following command:
fr: Depuis la version [1.8.0](https://github.com/FreshRSS/FreshRSS/releases/tag/1.8.0), l'administrateur peut modifier le mot de passe d'un utilisateur depuis un terminal. Il est bon de noter que celui-ci doit avoir un accès à PHP en ligne de commande. Pour cela, il suffit d'ouvrir son terminal et de saisir la commande suivante :

source: For more information on that matter, please refer to the [dedicated documentation](../../cli/README.md).
fr: Pour plus d'information à ce sujet, il existe la [documentation dédiée](../../cli/README.md).

source: Permissions under SELinux
fr: Gérer les permissions sous SELinux

source: Some Linux distribution, like Fedora or RedHat Enterprise Linux, have SELinux enabled. This acts similar to a firewall application, so that applications can't write or modify files under certain conditions. While installing FreshRSS, step 2 can fail if the httpd process can't write to some data sub-directories. The following command should be executed as root to fix this problem:
fr: Certaines distributions Linux comme Fedora ou RedHat Enterprise Linux (RHEL) activent par défaut le système SELinux. Celui-ci permet de gérer des permissions au niveau des processus. Lors de l'installation de FreshRSS, l'étape 2 procède à la vérification des droits sur certains répertoires, il faut donc exécuter la commande suivante en tant que root:

source: Why do I have a blank page while trying to configure the sharing options?
fr: Pourquoi y a-t-il une page blanche lorsque je configure les options de partage ?

source: The `sharing` word in the URL is a trigger word for some ad-blocker rules. Starting with version 1.16, `sharing` has been replaced by `integration` in the faulty URL while keeping the exact same wording throughout the application.
fr: Le mot `sharing` dans l'URL est un mot déclencheur pour certaines règles des bloqueurs de publicités. À partir de la version 1.16, `sharing` a été remplacé par `integration` dans l'URL posant problème tout en conservant exactement la même dénomination à travers l'application.

source: If you are using a version prior to 1.16, you can disable your ad-blocker for FreshRSS or you can add a rule to allow the `sharing` page to be accessed.
fr: Si vous utilisez une version antérieure à 1.16, vous pouvez désactiver votre bloqueur de publicité pour FreshRSS ou vous pouvez ajouter une règle pour permettre la consultation de la page de configuration « partage ».

source: Examples with _uBlock_:
fr: Exemples avec _uBlock_ :

source: Whitelist your FreshRSS instance by adding it in _uBlock > Open the dashboard > Whitelist_.
fr: Ajoutez votre instance FreshRSS à la liste blanche de en l'ajoutant dans _uBlock > Ouvrir le tableau de bord > Liste blanche_.

source: Authorize your FreshRSS instance to call `sharing` configuration page by adding the rule `*sharing,domain=~yourdomain.com` in _uBlock > Open the dashboard > My filters_
fr: Autorisez votre instance FreshRSS à appeler la page de configuration `sharing` en ajoutant la règle `*sharing,domain=~votredomaine.com` dans _uBlock > Ouvrir le fichier tableau de bord > Mes filtres_
