Repository: FreshRSS/FreshRSS
Catalog: docs/i18n/freshrss.*.po
Languages: fr

source: <?php $url_array = [ 'c' => 'hello', 'a' => 'world', 'params' => [ 'foo' => 'bar', ], ]; // Show something like .?c=hello&amp;a=world&amp;foo=bar echo Minz_Url::display($url_array); ?>
fr: <?php $url_array = [ 'c' => 'hello', 'a' => 'world', 'params' => [ 'foo' => 'bar', ], ]; // Affichera quelque chose comme .?c=hello&amp;a=world&amp;foo=bar echo Minz_Url::display($url_array); ?>

source: Since this can become a bit tedious to use in the long run, especially in views, it is preferable to use the `_url()` shortcut:
fr: Comme cela peut devenir un peu pénible à utiliser à la longue, surtout dans les vues, il est préférable d'utiliser le raccourci `_url()` :

source: <?php // Displays the same as above echo _url('hello', 'world', 'foo', 'bar'); ?>
fr: <?php // Affichera la même chose que précédemment echo _url('hello', 'world', 'foo', 'bar'); ?>

source: Note: as a general rule, the shortened form (`_url()`) should be used in views, while the long form (`Minz_Url::display()`) should be used in controllers.
fr: Note : en règle générale, la forme raccourcie (`_url()`) doit être utilisée dans les vues tandis que la forme longue (`Minz_Url::display()`) doit être utilisée dans les contrôleurs.

source: It is often necessary to redirect a user to another page. To do so, the `Minz_Request` class offers another useful method: `forward()`. This method takes the same URL format as the one seen just before as its argument.
fr: Il est souvent nécessaire de rediriger un utilisateur vers une autre page. Pour cela, la classe `Minz_Request` dispose d'une autre méthode utile : `forward()`. Cette méthode prend en argument le même format d'URL que celui vu juste avant.

source: <?php $url_array = [ 'c' => 'hello', 'a' => 'world', ]; // Tells Minz to redirect the user to the hello / world page. // Note that this is a redirection in the Minz sense of the term, not a redirection that the browser will have to manage (HTTP code 301 or 302) // The code that follows forward() will thus be executed! Minz_Request::forward($url_array); // To perform a type 302 redirect, add "true". // The code that follows will never be executed. Minz_Request::forward($url_array, true); ?>
fr: <?php $url_array = [ 'c' => 'hello', 'a' => 'world', ]; // Indique à Minz de rediriger l'utilisateur vers la page hello/world. // Notez qu'il s'agit d'une redirection au sens Minz du terme, pas d'une redirection que le navigateur va avoir à gérer (code HTTP 301 ou 302) // Le code qui suit forward() va ainsi être exécuté ! Minz_Request::forward($url_array); // Pour effectuer une redirection type 302, ajoutez "true". // Le code qui suivra ne sera alors jamais exécuté. Minz_Request::forward($url_array, true); ?>

source: It is very common to want display a message to the user while performing a redirect, to tell the user how the action was carried out (validation of a form for example). Such a message is passed through a `notification` session variable (note: we will talk about feedback from now on to avoid confusion with a notification that can occur at any time). To facilitate this kind of very frequent action, there are two shortcuts that both perform a 302 redirect by assigning a feedback message:
fr: Il est très fréquent de vouloir effectuer une redirection tout en affichant un message à l'utilisateur pour lui indiquer comment s'est déroulée l'action effectuée juste avant (validation d'un formulaire par exemple). Un tel message est passé par une variable de session `notification` (note : nous parlerons plutôt de « feedback » désormais pour éviter la confusion avec une notification qui peut survenir à tout moment). Pour faciliter ce genre d'action très fréquente, il existe deux raccourcis qui effectuent tout deux une redirection type 302 en affectant un message de feedback :

source: <?php $url_array = [ 'c' => 'hello', 'a' => 'world', ]; $feedback_good = 'All went well!'; $feedback_bad = 'Oops, something went wrong.'; Minz_Request::good($feedback_good, $url_array); // or Minz_Request::bad($feedback_bad, $url_array); ?>
fr: <?php $url_array = [ 'c' => 'hello', 'a' => 'world', ]; $feedback_good = 'Tout s\'est bien passé !'; $feedback_bad = 'Oups, quelque chose n\'a pas marché.'; Minz_Request::good($feedback_good, $url_array); // ou Minz_Request::bad($feedback_bad, $url_array); ?>

source: Translation Management
fr: Gestion de la traduction

source: It is common (and that's an understatement) to want to show some text to the user. In the previous example, for example, we display feedback to the user based on the result of form validation. The problem is that FreshRSS has users of different nationalities. It is therefore necessary to be able to manage different languages in order not to remain confined to English or French.
fr: Il est fréquent (et c'est un euphémisme) de vouloir afficher des phrases à l'utilisateur. Dans l'exemple précédent par exemple, nous affichions un feedback à l'utilisateur en fonction du résultat d'une validation de formulaire. Le problème est que FreshRSS possède des utilisateurs de différentes nationalités. Il est donc nécessaire de pouvoir gérer différentes langues pour ne pas rester cantonné à l'Anglais ou au Français.

source: The solution is to use the `Minz_Translate` class, which allows dynamic translation of FreshRSS (or any Minz-based application). Before using this module, it is necessary to know where to find the strings to be translated. Each language has its own subdirectory in a parent directory named `i18n`. For example, English language files are located in `i18n/fr/`. There are seven different files:
fr: La solution consiste à utiliser la classe `Minz_Translate` qui permet de traduire dynamiquement FreshRSS (ou toute application basée sur Minz). Avant d'utiliser ce module, il est nécessaire de savoir où trouver les chaînes de caractères à traduire. Chaque langue possède son propre sous-répertoire dans un répertoire parent nommé `i18n`. Par exemple, les fichiers de langue en Français sont situés dans `i18n/fr/`. Il existe sept fichiers différents :

source: `admin.php` for anything related to FreshRSS administration
fr: `admin.php` pour tout ce qui est relatif à l'administration de FreshRSS ;

source: `conf.php` for configuration
fr: `conf.php` pour l'aspect configuration ;

source: `feedback.php` contains translations of feedback messages
fr: `feedback.php` contient les traductions des messages de feedback ;

source: `gen.php` stores what is global to FreshRSS (gen for "general")
fr: `gen.php` stocke ce qui est global à FreshRSS (gen pour « general ») ;

source: `index.php` for the main page that lists feeds and the About page
fr: `index.php` pour la page principale qui liste les flux et la page « À propos » ;

source: `install.php` contains strings related FreshRSS installation
fr: `install.php` contient les phrases relatives à l'installation de FreshRSS ;

source: `sub.php` for subscription management (sub for "subscription")
fr: `sub.php` pour l'aspect gestion des abonnements (sub pour « subscription »).

source: This organization makes it possible to avoid a single huge translation file.
fr: Cette organisation permet de ne pas avoir un unique énorme fichier de traduction.

source: The translation files are quite simple: it's only a matter of returning a PHP table containing the translations. As an example, here's an extract from `app/i18n/fr/gen.php`:
fr: Les fichiers de traduction sont assez simples : il s'agit seulement de retourner un tableau PHP contenant les traductions. Extrait du fichier `app/i18n/fr/gen.php` :

source: To access these translations, `Minz_Translate` will help us with its `Minz_Translate::t()` method. As this can be a bit long to type, a shortcut has been introduced that **must** be used in all circumstances: `_t()`. Code example:
fr: Pour accéder à ces traductions, `Minz_Translate` va nous aider à l'aide de sa méthode `Minz_Translate::t()`. Comme cela peut être un peu long à taper, il a été introduit un raccourci qui **doit** être utilisé en toutes circonstances : `_t()`. Exemple de code :

source: The string to pass to the `_t()` function consists of a series of identifiers separated by dots. The first identifier indicates from which file to extract the translation (in this case, `gen.php`), while the following ones indicate table entries. Thus `action` is an entry of the main array and `back_to_rss_feeds` is an entry of the `action` array. This allows us to further organize our translation files.
fr: La chaîne à passer à la fonction `_t()` consiste en une série d'identifiants séparés par des points. Le premier identifiant indique de quel fichier on veut extraire la traduction (dans notre cas présent, de `gen.php`), tandis que les suivantes indiquent des entrées de tableaux. Ainsi `action` est une entrée du tableau principal et `back_to_rss_feeds` est une entrée du tableau `action`. Cela permet d'organiser encore un peu plus nos fichiers de traduction.

source: There is a small special case that sometimes makes life easier: the `_` identifier. This must necessarily be present at the end of the chain and gives a value to the higher-level identifier. It's pretty hard to explain but very simple to understand. In the example given above, a `_` is associated with the value `FreshRSS`: this means that there is no need to write `_t('gen.freshrss._')` but `_t('gen.freshrss')` suffices.
fr: Il existe un petit cas particulier qui permet parfois de se simplifier la vie : le cas de l'identifiant `_`. Celui-ci doit nécessairement être présent en bout de chaîne et permet de donner une valeur à l'identifiant de niveau supérieur. C'est assez dur à expliquer mais très simple à comprendre. Dans l'exemple donné plus haut, un `_` est associé à la valeur `FreshRSS` : cela signifie qu'il n'y a pas besoin d'écrire `_t('gen.freshrss._')` mais `_t('gen.freshrss')` suffit.

source: Configuration management
fr: Gestion de la configuration

source: Write an extension for FreshRSS
fr: Écrire une extension pour FreshRSS

source: Here we are! We've talked about the most useful features of Minz and how to run FreshRSS correctly and it's about time to address the extensions themselves.
fr: Nous y voilà ! Nous avons abordé les fonctionnalités les plus utiles de Minz et qui permettent de faire tourner FreshRSS correctement et il est plus que temps d'aborder les extensions en elles-même.

source: An extension allows you to easily add functionality to FreshRSS without having to touch the core of the project directly.
fr: Une extension permet donc d'ajouter des fonctionnalités facilement à FreshRSS sans avoir à toucher au cœur du projet directement.

source: Basic files and folders
fr: Les fichiers et répertoires de base

source: The first thing to note is that **all** extensions **must** be located in the `extensions` directory, at the base of the FreshRSS tree. An extension is a directory containing a set of mandatory (and optional) files and subdirectories. The convention requires that the main directory name be preceded by an "x" to indicate that it is not an extension included by default in FreshRSS.
fr: La première chose à noter est que **toutes** les extensions **doivent** se situer dans le répertoire `extensions`, à la base de l'arborescence de FreshRSS. Une extension est un répertoire contenant un ensemble de fichiers et sous-répertoires obligatoires ou facultatifs. La convention veut que l'on précède le nom du répertoire principal par un « x » pour indiquer qu'il ne s'agit pas d'une extension incluse par défaut dans FreshRSS.

source: The main directory of an extension must contain at least two **mandatory** files:
fr: Le répertoire principal d'une extension doit comporter au moins deux fichiers **obligatoire** :

source: A `metadata.json` file that contains a description of the extension. This file is written in JSON.
fr: Un fichier `metadata.json` qui contient une description de l'extension. Ce fichier est écrit en JSON ;

source: An `extension.php` file containing the entry point of the extension (which is a class that inherits Minz_Extension).
fr: Un fichier `extension.php` contenant le point d'entrée de l'extension.

source: `configure.phtml` is the file containing the form to parameterize your extension
fr: `configure.phtml` est le fichier contenant le formulaire pour paramétrer votre extension

source: `name`: the name of your extension
fr: `name` : le nom de votre extension ;

source: `author`: your name, your e-mail address ... but there is no specific format to adopt
fr: `author` : votre nom, éventuellement votre adresse mail mais il n'y a pas de format spécifique à adopter ;

source: `description`: a description of your extension
fr: `description` : une description de votre extension ;

source: `version`: the current version number of the extension
fr: `version` : le numéro de version actuel de l'extension ;

source: `entrypoint`: Indicates the entry point of your extension. It must match the name of the class contained in the file `extension.php` without the suffix` Extension` (so if the entry point is `HelloWorld`, your class will be called` HelloWorldExtension`)
fr: `entrypoint` : indique le point d'entrée de votre extension. Il doit correspondre au nom de la classe contenue dans le fichier `extension.php` sans le suffixe `Extension` (donc si le point d'entrée est `HelloWorld`, votre classe s'appellera `HelloWorldExtension`) ;

source: `type`: Defines the type of your extension. There are two types: `system` and` user`. We will study this difference right after.
fr: `type` : définit le type de votre extension. Il existe deux types : `system` et `user`. Nous étudierons cette différence juste après.

source: Only the `name` and` entrypoint` fields are required.
fr: Seuls les champs `name` et `entrypoint` sont requis.

source: Choosing between `system` and `user`
fr: Choisir entre extension « system » ou « user »

source: The "hooks" system
fr: Le système « hooks »

source: The .phtml files
fr: Les fichiers .phtml

source: Writing a URL
fr: Écrire une URL

source: Displaying an icon
fr: Afficher une icône

source: Template file
fr: Fichier modèle

source: Writing a new theme
fr: Écrire un nouveau thème

source: Overriding icons
fr: Surcharger les icônes

source: Preparing the release
fr: Préparer la sortie

source: In order to get as much feedback as possible before a release, it's preferable to announce it on GitHub by creating a dedicated ticket ([see examples] (https://github.com/FreshRSS/FreshRSS/search?utf8=%E2%9C%93&q=Call+for+testing&type=Issues)). This should be done **at least one week in advance**.
fr: Afin d'avoir le plus de retour possible avant une sortie, il est préférable de l'annoncer sur GitHub en créant un ticket dédié ([voir les exemples](https://github.com/FreshRSS/FreshRSS/search?utf8=%E2%9C%93&q=Call+for+testing&type=Issues)). Ceci est à faire **au moins une semaine à l'avance**.

source: It's also recommended to make the announcement on mailing@freshrss.org.
fr: Il est aussi recommandé de faire l'annonce sur mailing@freshrss.org.

source: Check the dev status
fr: S'assurer de l'état de dev

source: Before releasing a new version of FreshRSS, you must ensure that the code is stable and free of major bugs. Ideally, our tests should be automated and executed before any publication.
fr: Avant de sortir une nouvelle version de FreshRSS, il faut vous assurer que le code est stable et ne présente pas de bugs majeurs. Idéalement, il faudrait que nos tests soient automatisés et exécutés avant toute publication.

source: You must also **make sure that the CHANGELOG file is up to date** with the updates of the version to be released.
fr: Il faut aussi **vous assurer que le fichier CHANGELOG est à jour** avec les mises à jour de la version à sortir.

source: Git process
fr: Processus Git

source: $ git checkout master $ git pull $ vim constants.php # Update version number x.y.y.z of FRESHRSS_VERSION $ git commit -a Version x.y.z $ git tag -a x.y.z Version x.y.z $ git push && git push --tags
fr: $ git checkout master $ git pull $ vim constants.php # Mettre à jour le numéro de version x.y.z de FRESHRSS_VERSION $ git commit -a Version x.y.z $ git tag -a x.y.z Version x.y.z $ git push && git push --tags

source: Updating `update.freshrss.org`
fr: Mise à jour de update.freshrss.org

source: It's important to update update.freshrss.org since this is the default service for automatic FreshRSS updates.
fr: Il est important de mettre à jour update.freshrss.org puisqu'il s'agit du service par défaut gérant les mises à jour automatiques de FreshRSS.

source: The repository managing the code is located on GitHub: [FreshRSS/update.freshrss.org] (https://github.com/FreshRSS/update.freshrss.org/).
fr: Le dépot gérant le code se trouve sur GitHub : [FreshRSS/update.freshrss.org](https://github.com/FreshRSS/update.freshrss.org/).

source: Writing the update script
fr: Écriture du script de mise à jour

source: The scripts are located in the `./scripts/` directory and must take the form `update_to_x.y.z.z.php`. This directory also contains `update_to_dev.php` intended for updates of the `master` branch (this script must not include code specific to a particular version!) and `update_util.php`, which contains a list of functions useful for all scripts.
fr: Les scripts se trouvent dans le répertoire `./scripts/` et doivent être de la forme `update_to_x.y.z.php`. On trouve aussi dans ce répertoire `update_to_dev.php` destiné aux mises à jour de la branche `master` (ce script ne doit pas inclure de code spécifique à une version particulière !) et `update_util.php` contenant une liste de fonctions utiles à tous les scripts.

source: In order to write a new script, it's better to copy/paste the last version or to start from `update_to_dev.php`. The first thing to do is to define the URL from which the FreshRSS package will be downloaded (`PACKAGE_URL`). The URL is in the form of `https://codeload.github.com/FreshRSS/FreshRSS/zip/x.y.z`.
fr: Afin d'écrire un nouveau script, il est préférable de copier / coller celui de la dernière version ou de partir de `update_to_dev.php`. La première chose à faire est de définir l'URL à partir de laquelle sera téléchargée le package FreshRSS (`PACKAGE_URL`). L'URL est de la forme `https://codeload.github.com/FreshRSS/FreshRSS/zip/x.y.z`.

source: There are then 5 functions that have to be executed:
fr: Il existe ensuite 5 fonctions à remplir :

source: `apply_update()` takes care of saving the directory containing the data, checking its structure, downloading the FreshRSS package, deploying it and cleaning it all up. This function is pre-filled but adjustments can be made if necessary (e.g., reorganization of the `./data` structure). It returns `true` if no problem has occurred or a string indicating a problem;
fr: `apply_update()` qui se charge de sauvegarder le répertoire contenant les données, de vérifier sa structure, de télécharger le package FreshRSS, de le déployer et de tout nettoyer. Cette fonction est pré-remplie mais des ajustements peuvent être faits si besoin est (ex. réorganisation de la structure de `./data`). Elle retourne `true` si aucun problème n'est survenu ou une chaîne de caractères indiquant un soucis ;

source: `need_info_update()` returns `true` if the user must intervene during the update or `false` if not;
fr: `need_info_update()` retourne `true` si l'utilisateur doit intervenir durant la mise à jour ou `false` sinon ;

source: `ask_info_update()` displays a form to the user if `need_info_update()` has returned `true`;
fr: `ask_info_update()` affiche un formulaire à l'utilisateur si `need_info_update()` a retourné `true` ;

source: `save_info_update()` is responsible for saving the information filled out by the user (from the `ask_info_update()` form);
fr: `save_info_update()` est chargée de sauvegarder les informations renseignées par l'utilisateur (issues du formulaire de `ask_info_update()`) ;

source: `do_post_update()` is executed at the end of the update and takes into account the code of the new version (e.g., if the new version changes the `Minz_Configuration` object, you will benefit from these improvements).
fr: `do_post_update()` est exécutée à la fin de la mise à jour et prend en compte le code de la nouvelle version (ex. si la nouvelle version modifie l'objet `Minz_Configuration`, vous bénéficierez de ces améliorations).

source: Updating the versions file
fr: Mise à jour du fichier de versions

source: Once the script has been written and versioned, it's necessary to update the `./versions.php' file which contains a mapping table indicating which versions are updated to which other versions.
fr: Lorsque le script a été écrit et versionné, il est nécessaire de mettre à jour le fichier `./versions.php` qui contient une table de correspondances indiquant quelles versions sont mises à jour vers quelles autres versions.

source: Here's an example of a `versions.php` file:
fr: Voici un exemple de fichier `versions.php` :

source: And here's how this table works:
fr: Et voici comment fonctionne cette table :

source: on the left you can find the N version, on the right the N+1 version;
fr: à gauche se trouve la version N, à droite la version N+1 ;

source: the `x.y.z.z-dev` versions are **all** updated to `master`;
fr: les versions `x.y.z-dev` sont **toutes** mises à jour vers `master` ;

source: stable versions are updated to stable versions;
fr: les versions stables sont mises à jour vers des versions stables ;

source: it's possible to skip several versions at once, provided that the update scripts support it;
fr: il est possible de sauter plusieurs versions d'un coup à condition que les scripts de mise à jour le prennent en charge ;

source: it's advisable to indicate the correspondence of the current version to its potential future version by specifying that this version does not yet exist. As long as the corresponding script does not exist, nothing will happen.
fr: il est conseillé d'indiquer la correspondance de la version courante vers sa potentielle future version en précisant que cette version n'existe pas encore. Tant que le script correspondant n'existera pas, rien ne se passera.

source: It's **very strongly** recommended to keep this file organized according to version numbers by separating stable and dev versions.
fr: Il est **très fortement** indiqué de garder ce fichier rangé selon les numéros de versions en séparant les versions stables et de dev.

source: Deployment
fr: Déploiement

source: Before updating update.freshrss.org, it's better to test with dev.update.freshrss.org, which corresponds to pre-production. So update dev.update.freshrss.org and change the `FRESHRSS_UPDATE_WEBSITE` URL of your FreshRSS instance. Start the update and check that it's running correctly.
fr: Avant de mettre à jour update.freshrss.org, il est préférable de tester avec dev.update.freshrss.org qui correspond à la pré-production. Mettez donc à jour dev.update.freshrss.org et changez l'URL `FRESHRSS_UPDATE_WEBSITE` de votre instance FreshRSS. Lancez la mise à jour et vérifiez que celle-ci se déroule correctement.

source: When you're satisfied, update update.freshrss.org with the new script, test it again, and then move on.
fr: Lorsque vous serez satisfait, mettez à jour update.freshrss.org avec le nouveau script et en testant de nouveau puis passez à la suite.

source: Updating the FreshRSS services
fr: Mise à jour des services FreshRSS

source: Two services need to be updated immediately after the update.
fr: Deux services sont à mettre à jour immédiatement après la mise à jour de update.freshrss.org :

source: demo.freshrss.org (public login: `demo` / `demodemo`).
fr: demo.freshrss.org (identifiants publics : `demo` / `demodemo`).

source: Publicly announce the release
fr: Annoncer publiquement la sortie
