<?php

/******************************************************************************
 * Each entry of that file can be associated with a comment to indicate its   *
 * state. When there is no comment, it means the entry is fully translated.   *
 * The recognized comments are (comment matching is case-insensitive):        *
 *   + TODO: the entry has never been translated.                             *
 *   + DIRTY: the entry has been translated but needs to be updated.          *
 *   + IGNORE: the entry does not need to be translated.                      *
 * When a comment is not recognized, it is discarded.                         *
 ******************************************************************************/

return array(
	'action' => array(
		'finish' => 'Завяршыць усталяванне',
		'fix_errors_before' => 'Перад пераходам да наступнага кроку выпраўце ўсе памылкі.',
		'keep_install' => 'Захаваць папярэднюю канфігурацыю',
		'next_step' => 'Перайсці да наступнага кроку',
		'reinstall' => 'Пераўсталяваць FreshRSS',
	),
	'bdd' => array(
		'_' => 'База даных',
		'conf' => array(
			'_' => 'Канфігурацыя базы даных',
			'ko' => 'Праверце канфігурацыю базы даных.',
			'ok' => 'Канфігурацыя базы даных захавана.',
		),
		'host' => 'Хост',
		'password' => 'Пароль базы даных',
		'prefix' => 'Прэфікс табліц',
		'type' => 'Тып базы даных',
		'username' => 'Імя карыстальніка базы даных',
	),
	'check' => array(
		'_' => 'Праверкі',
		'already_installed' => 'Выяўлена, што FreshRSS ужо ўсталяваны!',
		'cache' => array(
			'nok' => 'Праверце правы доступу да каталога <em>%1$s</em> для карыстальніка <em>%2$s</em>. HTTP-сервер павінен мець права на запіс.',
			'ok' => 'Правы доступу да каталога кэшу ў парадку.',
		),
		'ctype' => array(
			'nok' => 'Не ўдаецца знайсці неабходную бібліятэку для праверкі тыпаў сімвалаў (php-ctype).',
			'ok' => 'У вас ёсць неабходная бібліятэка для праверкі тыпаў сімвалаў (ctype).',
		),
		'curl' => array(
			'nok' => 'Не ўдаецца знайсці неабходную бібліятэку cURL (пакет php-curl).',
			'ok' => 'У вас ёсць неабходная бібліятэка cURL.',
		),
		'data' => array(
			'nok' => 'Праверце правы доступу да каталога <em>%1$s</em> для карыстальніка <em>%2$s</em>. HTTP-сервер павінен мець права на запіс.',
			'ok' => 'Правы доступу да каталога даных у парадку.',
		),
		'database-connection' => array(
			'nok' => 'Памылка злучэння з базай даных.',
			'ok' => 'Злучэнне з базай даных наладжана.',
		),
		'database-table' => array(
			'nok' => 'Табліца базы даных «%s» няпоўная.',
			'ok' => 'Табліца базы даных «%s» у парадку.',
		),
		'database-tables' => array(
			'nok' => 'Некаторыя табліцы базы даных адсутнічаюць.',
			'ok' => 'Усе табліцы базы даных існуюць.',
		),
		'database-title' => 'База даных',
		'docroot' => array(
			'nok' => 'Каранёвы каталог дакументаў вэб-сервера, здаецца, не паказвае на папку <code>./p/</code>. Іншыя папкі, такія як <code>./data/</code>, могуць быць агульнадаступнымі.',
			'ok' => 'Каранёвы каталог вэб-сервера правільна паказвае на папку <code>./p/</code>.',
		),
		'dom' => array(
			'nok' => 'Немагчыма знайсці патрэбную бібліятэку для прагляду DOM.',
			'ok' => 'У вас ёсць патрэбная бібліятэка для прагляду DOM.',
		),
		'favicons' => array(
			'nok' => 'Праверце правы доступу да каталога <em>%1$s</em> для карыстальніка <em>%2$s</em>. HTTP-сервер павінен мець права на запіс.',
			'ok' => 'Правы доступу да каталога значкоў у парадку.',
		),
		'fileinfo' => array(
			'nok' => 'Немагчыма знайсці рэкамендаваную бібліятэку PHP fileinfo (пакет fileinfo).',
			'ok' => 'У вас ёсць рэкамендаваная бібліятэка PHP fileinfo (пакет fileinfo).',
		),
		'files' => 'Усталяванне файлаў',
		'gmp' => array(
			'nok' => 'Немагчыма знайсці патрэбнае пашырэнне GMP для 32-разраднага PHP (пакет php-gmp).',
			'ok' => 'У вас ёсць патрэбнае пашырэнне GMP для 32-разраднага PHP.',
		),
		'intl' => array(
			'nok' => 'Немагчыма знайсці рэкамендаваную бібліятэку php-intl для інтэрнацыяналізацыі.',
			'ok' => 'У вас ёсць рэкамендаваная бібліятэка php-intl для інтэрнацыяналізацыі.',
		),
		'json' => array(
			'nok' => 'Немагчыма знайсці патрэбную бібліятэку для разбору JSON.',
			'ok' => 'У вас ёсць патрэбная бібліятэка для разбору JSON.',
		),
		'mbstring' => array(
			'nok' => 'Немагчыма знайсці рэкамендаваную бібліятэку mbstring для Unicode.',
			'ok' => 'У вас ёсць рэкамендаваная бібліятэка mbstring для Unicode.',
		),
		'pcre' => array(
			'nok' => 'Немагчыма знайсці патрэбную бібліятэку для рэгулярных выразаў (php-pcre).',
			'ok' => 'У вас ёсць патрэбная бібліятэка для рэгулярных выразаў (PCRE).',
		),
		'pdo-mysql' => array(
			'nok' => 'Немагчыма знайсці патрэбны драйвер PDO для MySQL/MariaDB.',
		),
		'pdo-pgsql' => array(
			'nok' => 'Немагчыма знайсці патрэбны драйвер PDO для PostgreSQL.',
		),
		'pdo-sqlite' => array(
			'nok' => 'Немагчыма знайсці драйвер PDO для SQLite.',
			'ok' => 'У вас ёсць драйвер PDO для SQLite.',
		),
		'pdo' => array(
			'nok' => 'Немагчыма знайсці PDO або адзін з драйвераў, што падтрымліваюцца (pdo_sqlite, pdo_pgsql, pdo_mysql).',
			'ok' => 'У вас ёсць PDO і прынамсі адзін з драйвераў, што падтрымліваюцца (pdo_sqlite, pdo_pgsql, pdo_mysql).',
		),
		'php' => array(
			'_' => 'Усталяванне PHP',
			'nok' => 'Версія PHP — %s, але для FreshRSS патрабуецца версія не ніжэйшая за %s.',
			'ok' => 'Версія PHP (%s) сумяшчальная з FreshRSS.',
		),
		'reload' => 'Праверыць яшчэ раз',
		'tmp' => array(
			'nok' => 'Праверце правы доступу да каталога <em>%1$s</em> для карыстальніка <em>%2$s</em>. HTTP-сервер павінен мець правы на запіс.',
			'ok' => 'Правы доступу да часовага каталога ў парадку.',
		),
		'tokens' => array(
			'nok' => 'Праверце правы доступу да каталога <em>./data/tokens</em>. HTTP-сервер павінен мець права на запіс.',
			'ok' => 'Правы доступу да каталога токенаў у парадку.',
		),
		'unknown_process_username' => 'невядома',
		'users' => array(
			'nok' => 'Праверце правы доступу да каталога <em>%1$s</em> для карыстальніка <em>%2$s</em>. HTTP-сервер павінен мець правы на запіс.',
			'ok' => 'Правы доступу да каталога карыстальнікаў у парадку.',
		),
		'xml' => array(
			'nok' => 'Немагчыма знайсці патрэбную бібліятэку для разбору XML.',
			'ok' => 'У вас ёсць патрэбная бібліятэка для разбору XML.',
		),
		'zip' => array(
			'nok' => 'Немагчыма знайсці рэкамендаванае пашырэнне для ZIP (пакет php-zip).',
			'ok' => 'У вас ёсць рэкамендаванае пашырэнне для ZIP (пакет php-zip).',
		),
	),
	'conf' => array(
		'_' => 'Агульныя параметры',
		'ok' => 'Агульныя параметры захаваны.',
	),
	'congratulations' => 'Віншуем!',
	'default_user' => array(
		'_' => 'Імя прадвызначанага карыстальніка',
		'max_char' => '1-39 сімвалаў: літары, лічбы і <code>. _ @ -</code>',
	),
	'fix_errors_before' => 'Выпраўце памылкі перад пераходам да наступнага кроку.',
	'javascript_is_better' => 'FreshRSS прыемней выкарыстоўваць з уключаным JavaScript',
	'js' => array(
		'confirm_reinstall' => 'Пераўсталяванне FreshRSS прывядзе да страты папярэдняй канфігурацыі. Вы ўпэўнены, што хочаце працягнуць?',
	),
	'language' => array(
		'_' => 'Мова',
		'choose' => 'Выберыце мову для FreshRSS',
		'defined' => 'Мова вызначана.',
	),
	'missing_applied_migrations' => 'Нешта пайшло не так; стварыце ўручную пусты файл <em>%s</em>.',
	'ok' => 'Працэс усталявання паспяхова завершаны.',
	'session' => array(
		'nok' => 'Здаецца, вэб-сервер няправільна сканфігураваны для выкарыстання кукі, неабходных для сеансаў PHP!',
	),
	'step' => 'крок %d',
	'steps' => 'Крокі',
	'this_is_the_end' => 'Гатова',
	'title' => 'Усталяванне · FreshRSS',
);
