<?php

/******************************************************************************
 * Each entry of that file can be associated with a comment to indicate its   *
 * state. When there is no comment, it means the entry is fully translated.   *
 * The recognized comments are (comment matching is case-insensitive):        *
 *   + TODO: the entry has never been translated.                             *
 *   + DIRTY: the entry has been translated but needs to be updated.          *
 *   + IGNORE: the entry does not need to be translated.                      *
 * When a comment is not recognized, it is discarded.                         *
 ******************************************************************************/

return array(
	'access' => array(
		'denied' => 'Δεν έχετε άδεια πρόσβασης σε αυτή τη σελίδα',
		'not_found' => 'Αναζητάτε μια σελίδα που δεν υπάρχει',
	),
	'admin' => array(
		'optimization_complete' => 'Η βελτιστοποίηση ολοκληρώθηκε',
	),
	'api' => array(
		'password' => array(
			'failed' => 'Ο κωδικός πρόσβασής σας δεν μπορεί να τροποποιηθεί',
			'updated' => 'Ο κωδικός πρόσβασής σας έχει τροποποιηθεί',
		),
	),
	'auth' => array(
		'login' => array(
			'invalid' => 'Μη έγκυρη σύνδεση',
			'success' => 'Είστε συνδεδεμένος/η',
		),
		'logout' => array(
			'success' => 'Έχετε αποσυνδεθεί',
		),
	),
	'conf' => array(
		'error' => 'Παρουσιάστηκε σφάλμα κατά την αποθήκευση της διαμόρφωσης',
		'query_created' => 'Το ερώτημα «%s» δημιουργήθηκε.',
		'shortcuts_updated' => 'Οι συντομεύσεις έχουν ενημερωθεί',
		'updated' => 'Η διαμόρφωση έχει ενημερωθεί',
	),
	'extensions' => array(
		'already_enabled' => 'Το %s είναι ήδη ενεργοποιημένο',
		'cannot_remove' => 'Το %s δεν μπορεί να αφαιρεθεί',
		'disable' => array(
			'ko' => 'Το %s δεν μπορεί να απενεργοποιηθεί. <a href="%s">Ελέγξτε τα αρχεία καταγραφής του FreshRSS</a> για λεπτομέρειες.',
			'ok' => 'Το %s είναι πλέον απενεργοποιημένο',
		),
		'enable' => array(
			'ko' => 'Το %s δεν μπορεί να ενεργοποιηθεί. <a href="%s">Ελέγξτε τα αρχεία καταγραφής του FreshRSS</a> για λεπτομέρειες.',
			'ok' => 'Το %s είναι πλέον ενεργοποιημένο',
		),
		'invalid_view_mode' => 'Μη έγκυρη λειτουργία προβολής «%s»! Επιστροφή στην «Κανονική προβολή».',
		'no_access' => 'Δεν έχετε πρόσβαση στο %s',
		'not_enabled' => 'Το %s δεν είναι ενεργοποιημένο',
		'not_found' => 'Το %s δεν υπάρχει',
		'removed' => 'Το %s αφαιρέθηκε',
	),
	'import_export' => array(
		'export_no_zip_extension' => 'Η επέκταση ZIP δεν υπάρχει στον διακομιστή σας. Παρακαλούμε δοκιμάστε να εξάγετε τα αρχεία ένα προς ένα.',
		'feeds_imported' => 'Οι ροές σας έχουν εισαχθεί. Αν ολοκληρώσατε την εισαγωγή, μπορείτε τώρα να κάνετε κλικ στο κουμπί <i>Ενημέρωση ροών</i>.',
		'feeds_imported_with_errors' => 'Οι ροές σας έχουν εισαχθεί, αλλά παρουσιάστηκαν κάποια σφάλματα. Αν ολοκληρώσατε την εισαγωγή, μπορείτε τώρα να κάνετε κλικ στο κουμπί <i>Ενημέρωση ροών</i>.',
		'file_cannot_be_uploaded' => 'Το αρχείο δεν μπορεί να μεταφορτωθεί!',
		'no_zip_extension' => 'Η επέκταση ZIP δεν υπάρχει στον διακομιστή σας.',
		'zip_error' => 'Παρουσιάστηκε σφάλμα κατά την επεξεργασία του ZIP.',
	),
	'profile' => array(
		'error' => 'Το προφίλ σας δεν μπορεί να τροποποιηθεί',
		'passwords_dont_match' => 'Οι κωδικοί πρόσβασης δεν ταιριάζουν',
		'updated' => 'Το προφίλ σας έχει τροποποιηθεί',
	),
	'sub' => array(
		'actualize' => 'Ενημέρωση',
		'articles' => array(
			'marked_read' => 'Τα επιλεγμένα άρθρα έχουν σημειωθεί ως αναγνωσμένα.',
			'marked_unread' => 'Τα άρθρα έχουν σημειωθεί ως μη αναγνωσμένα.',
		),
		'category' => array(
			'created' => 'Η κατηγορία %s δημιουργήθηκε.',
			'deleted' => 'Η κατηγορία διαγράφηκε.',
			'emptied' => 'Η κατηγορία εκκενώθηκε',
			'error' => 'Η κατηγορία δεν μπορεί να ενημερωθεί',
			'name_exists' => 'Το όνομα της κατηγορίας υπάρχει ήδη.',
			'no_id' => 'Πρέπει να ορίσετε το ID της κατηγορίας.',
			'no_name' => 'Το όνομα της κατηγορίας δεν μπορεί να είναι κενό.',
			'not_delete_default' => 'Δεν μπορείτε να διαγράψετε την προεπιλεγμένη κατηγορία!',
			'not_exist' => 'Η κατηγορία δεν υπάρχει!',
			'over_max' => 'Έχετε φτάσει στο όριο των κατηγοριών σας (%d)',
			'updated' => 'Η κατηγορία έχει ενημερωθεί.',
		),
		'feed' => array(
			'actualized' => 'Η <em>%s</em> έχει ενημερωθεί',
			'actualizeds' => 'Οι ροές RSS έχουν ενημερωθεί',
			'added' => 'Η ροή RSS <em>%s</em> προστέθηκε',
			'already_subscribed' => 'Είστε ήδη εγγεγραμμένος/η στο <em>%s</em>',
			'cache_cleared' => 'Η μνήμη cache της <em>%s</em> έχει εκκαθαριστεί',
			'deleted' => 'Η ροή διαγράφηκε',
			'error' => 'Η ροή δεν μπορεί να ενημερωθεί',
			'favicon' => array(
				'too_large' => 'Το μεταφορτωμένο εικονίδιο είναι πολύ μεγάλο. Το μέγιστο μέγεθος αρχείου είναι <em>%s</em>.',
				'unsupported_format' => 'Μη υποστηριζόμενη μορφή αρχείου εικόνας!',
			),
			'internal_problem' => 'Η ροή ειδήσεων δεν μπορούσε να προστεθεί. <a href="%s">Ελέγξτε τα αρχεία καταγραφής του FreshRSS</a> για λεπτομέρειες. Μπορείτε να δοκιμάσετε να την προσθέσετε με δύναμη appending <code>#force_feed</code> στο URL.',
			'invalid_url' => 'Το URL <em>%s</em> είναι μη έγκυρο',
			'likely_duplicate' => 'This URL looks similar to your existing feed <em>%s</em>. Do you want to add it anyway?',	// TODO
			'n_actualized' => '%d ροές έχουν ενημερωθεί',
			'n_entries_deleted' => '%d άρθρα έχουν διαγραφεί',
			'no_refresh' => 'Δεν υπάρχουν ροές για ανανέωση',
			'not_added' => 'Η <em>%s</em> δεν μπορούσε να προστεθεί',
			'not_found' => 'Η ροή δεν βρέθηκε',
			'over_max' => 'Έχετε φτάσει στο όριο των ροών σας (%d)',
			'reloaded' => 'Η <em>%s</em> έχει επαναφορτωθεί',
			'selector_preview' => array(
				'http_error' => 'Αποτυχία φόρτωσης περιεχομένου ιστότοπου.',
				'no_entries' => 'Δεν υπάρχουν άρθρα σε αυτή τη ροή. Χρειάζεστε τουλάχιστον ένα άρθρο για να δημιουργήσετε προεπισκόπηση.',
				'no_feed' => 'Εσωτερικό σφάλμα (η ροή δεν βρέθηκε).',
				'no_result' => 'Ο επιλογέας δεν ταίριαξε με τίποτα. Ως εναλλακτική λύση, θα εμφανιστεί το αρχικό κείμενο της ροής.',
				'selector_empty' => 'Ο επιλογέας είναι κενός. Πρέπει να ορίσετε έναν για να δημιουργήσετε προεπισκόπηση.',
			),
			'updated' => 'Η ροή έχει ενημερωθεί',
		),
		'purge_completed' => 'Η εκκαθάριση ολοκληρώθηκε (%d άρθρα διαγράφηκαν)',
	),
	'tag' => array(
		'created' => 'Η ετικέτα «%s» δημιουργήθηκε.',
		'error' => 'Η ετικέτα δεν μπόρεσε να ενημερωθεί!',
		'name_exists' => 'Το όνομα της ετικέτας υπάρχει ήδη.',
		'renamed' => 'Η ετικέτα «%s» μετονομάστηκε σε «%s».',
		'updated' => 'Η ετικέτα έχει ενημερωθεί.',
	),
	'update' => array(
		'can_apply' => 'Το FreshRSS θα ενημερωθεί τώρα στην <strong>έκδοση %s</strong>.',
		'error' => 'Η διαδικασία ενημέρωσης αντιμετώπισε ένα σφάλμα: %s',
		'file_is_nok' => 'Νέα <strong>έκδοση %s</strong> διαθέσιμη, αλλά ελέγξτε τα δικαιώματα στον κατάλογο <em>%s</em>. Ο διακομιστής HTTP πρέπει να έχει δικαίωμα εγγραφής',
		'finished' => 'Η ενημέρωση ολοκληρώθηκε!',
		'none' => 'Δεν υπάρχει ενημέρωση για εφαρμογή',
		'server_not_found' => 'Ο διακομιστής ενημέρωσης δεν βρέθηκε. [%s]',
	),
	'user' => array(
		'created' => array(
			'_' => 'Ο χρήστης %s δημιουργήθηκε',
			'error' => 'Ο χρήστης %s δεν μπορεί να δημιουργηθεί',
		),
		'deleted' => array(
			'_' => 'Ο χρήστης %s διαγράφηκε',
			'error' => 'Ο χρήστης %s δεν μπορεί να διαγραφεί',
		),
		'updated' => array(
			'_' => 'Ο χρήστης %s ενημερώθηκε',
			'error' => 'Ο χρήστης %s δεν ενημερώθηκε',
		),
	),
);
